

const internalMed=[
  {
    "disease": "感冒 ",
    "syndromes": [
      {
        "name": "風寒證 ",
        "symptoms": ["惡寒重", "發熱輕", "無汗", "頭痛", "肢節痠疼", "鼻塞聲重", "時流清涕", "喉癢", "咳嗽", "痰吐稀薄色白", "口不渴或渴喜熱飲", "舌苔薄白而潤", "脈浮或浮緊"]
      },
      {
        "name": "風熱證 ",
        "symptoms": ["身熱較著", "微惡風", "汗泄不暢", "頭脹痛", "咳嗽", "痰粘或黃", "咽燥", "咽喉乳蛾紅腫疼痛", "鼻塞", "流黃濁涕", "口渴欲飲", "舌苔薄白微黃", "邊尖紅", "脈象浮數"]
      },
      {
        "name": "暑濕證 ",
        "symptoms": ["身熱", "微惡風", "汗少", "肢體痠重或疼痛", "頭昏重脹痛", "咳嗽痰粘", "鼻流濁涕", "心煩", "口渴欲飲或口中粘膩", "渴不多飲", "胸悶", "泛噁", "小便短赤", "舌苔薄黃而膩", "脈濡數"]
      },
      {
        "name": "氣虛感冒 ",
        "symptoms": ["惡寒較甚", "發熱", "無汗", "身楚倦怠", "咳嗽", "咯痰無力", "舌苔淡白", "脈浮無力"]
      },
      {
        "name": "陰虛感冒 ",
        "symptoms": ["身熱", "微惡風寒", "少汗", "頭昏", "心煩", "口乾", "乾咳痰少", "舌紅少苔", "脈細數"]
      }
    ]
  },
  {
    "disease": "咳嗽 ",
    "syndromes": [
      {
        "name": "風寒襲肺 ",
        "symptoms": ["咳嗽聲重", "氣急", "咽癢", "咳痰稀薄色白", "鼻塞", "流清涕", "頭痛", "肢體痠楚", "惡寒", "發熱", "無汗", "舌苔薄白", "脈浮或浮緊"]
      },
      {
        "name": "風熱犯肺 ",
        "symptoms": ["咳嗽頻劇", "氣粗", "咳聲嗄啞", "喉燥咽痛", "咯痰不爽", "痰粘稠或稠黃", "咳時汗出", "鼻流黃涕", "口渴", "頭痛", "肢楚", "惡風", "身熱", "舌苔薄黃", "脈浮數或浮滑"]
      },
      {
        "name": "風燥傷肺 ",
        "symptoms": ["乾咳", "連聲作嗆", "喉癢", "咽喉乾痛", "脣鼻乾燥", "無痰或痰少而粘連成絲", "痰中帶血絲", "口乾", "舌質紅", "乾而少津", "脈浮數或小數"]
      },
      {
        "name": "痰濕蘊肺 ",
        "symptoms": ["咳嗽反覆發作", "咳聲重濁", "痰多", "痰粘膩或稠厚成塊", "色白或帶灰色", "早晨或食後咳甚", "胸悶", "脘痞", "嘔噁", "食少", "體倦", "大便時溏", "舌苔白膩", "脈象滑"]
      },
      {
        "name": "痰熱鬱肺 ",
        "symptoms": ["咳嗽氣息粗促", "喉中有痰聲", "痰多質粘厚或稠黃", "咯吐不爽", "有熱腥味", "吐血痰", "胸肋脹滿", "咳時引痛", "面赤", "身熱", "口乾欲飲", "舌苔薄黃膩", "質紅", "脈滑數"]
      },
      {
        "name": "肝火犯肺 ",
        "symptoms": ["上氣咳逆陣作", "咳時面赤", "咽乾", "痰滯咽喉", "量少質粘", "胸脇脹痛", "咳時引痛", "口乾苦", "舌苔薄黃少津", "脈象弦數"]
      },
      {
        "name": "肺陰虧耗 ",
        "symptoms": ["乾咳", "咳聲短促", "痰少粘白", "痰中挾血", "聲音嘶啞", "口乾咽燥", "午後潮熱", "顴紅", "手足心熱", "夜寐盜汗", "日漸消瘦", "神疲", "舌質紅少苔", "脈細數"]
      }
    ]
  },
  {
    "disease": "肺痿 ",
    "syndromes": [
      {
        "name": "虛熱 ",
        "symptoms": ["咳吐濁唾涎沫", "質較粘稠", "咳痰帶血", "咳聲不揚", "音嗄", "氣急喘促", "口渴咽燥", "午後潮熱", "形體消瘦", "皮毛乾枯", "舌紅而乾", "脈虛數"]
      },
      {
        "name": "虛寒 ",
        "symptoms": ["咯吐涎沫", "質清稀量多", "不渴", "短氣不足以息", "頭眩", "神疲乏力", "食少", "形寒", "小便數", "遺尿", "舌質淡", "脈虛弱"]
      }
    ]
  },
  {
    "disease": "肺癰 ",
    "syndromes": [
      {
        "name": "初期 ",
        "symptoms": ["惡寒發熱", "咳嗽", "咯白色粘沫痰", "胸痛", "呼吸不利", "口乾鼻燥", "苔薄黃或薄白", "脈浮數而滑"]
      },
      {
        "name": "成癰期 ",
        "symptoms": ["身熱轉甚", "壯熱", "時時振寒", "汗出煩躁", "咳嗽氣急", "胸滿作痛", "咳吐濁痰黃綠色", "喉間有腥味", "口乾咽燥", "苔黃膩", "脈滑數"]
      },
      {
        "name": "潰膿期 ",
        "symptoms": ["咳吐大量腥臭膿血痰", "狀如米粥", "胸中煩滿而痛", "氣喘不能臥", "身熱面赤", "煩渴喜飲", "苔黃膩", "質紅", "脈滑數或數實"]
      },
      {
        "name": "恢復期 ",
        "symptoms": ["身熱漸退", "咳嗽減輕", "咯吐膿血漸少", "精神漸振", "食納好轉", "氣短", "自汗", "盜汗", "低燒", "午後潮熱", "口燥咽乾", "形體消瘦", "舌質紅或淡紅", "脈細數無力"]
      }
    ]
  },
  {
    "disease": "哮病 ",
    "syndromes": [
      {
        "name": "寒哮 ",
        "symptoms": ["呼吸急促", "喉中哮鳴有聲", "胸膈滿悶如塞", "痰少咯吐不爽", "面色晦滯帶青", "口不渴或渴喜熱飲", "形寒怕冷", "舌苔白滑", "脈弦緊或浮緊"]
      },
      {
        "name": "熱哮 ",
        "symptoms": ["氣粗息湧", "喉中痰鳴如吼", "胸高脇脹", "咳嗆陣作", "咳痰色黃或白", "粘濁稠厚", "煩悶不安", "汗出面赤", "口苦口渴", "舌苔黃膩", "質紅", "脈滑數"]
      },
      {
        "name": "肺虛 ",
        "symptoms": ["自汗怕風", "常易感冒", "氣短聲低", "喉中輕度哮鳴音", "咳痰清稀色白", "面色晄白", "舌質淡", "脈細弱"]
      },
      {
        "name": "脾虛 ",
        "symptoms": ["食少脘痞", "大便不實", "倦怠", "氣短不足以息", "語言無力", "舌質淡", "脈細軟"]
      },
      {
        "name": "腎虛 ",
        "symptoms": ["短氣息促", "動則為甚", "吸氣不利", "心慌", "腦轉耳鳴", "腰痠腿軟", "畏寒肢冷", "或顴紅煩熱", "汗出粘手", "脈沉細或細數"]
      }
    ]
  },
  {
    "disease": "喘病 ",
    "syndromes": [
      {
        "name": "風寒襲肺 ",
        "symptoms": ["喘咳氣急", "胸部脹悶", "痰多稀薄色白", "頭痛", "惡寒", "無汗", "苔薄白而滑", "脈浮緊"]
      },
      {
        "name": "表寒裡熱 ",
        "symptoms": ["喘逆上氣", "胸脹或痛", "息粗鼻煽", "咳而不爽", "痰吐稠粘", "形寒身熱", "煩悶", "口渴", "質紅", "脈浮數"]
      },
      {
        "name": "痰熱鬱肺 ",
        "symptoms": ["喘咳氣湧", "胸部脹痛", "痰多粘稠色黃", "胸中煩熱", "身熱", "有汗", "面紅", "咽乾", "尿赤", "苔黃或膩", "脈滑數"]
      },
      {
        "name": "痰濁阻肺 ",
        "symptoms": ["喘而胸滿悶窒", "胸盈仰息", "咳嗽痰多粘膩色白", "嘔惡", "納呆", "口粘不渴", "苔厚膩", "脈滑"]
      },
      {
        "name": "肺氣鬱痹 ",
        "symptoms": ["情志誘發", "突然呼吸短促", "喉中痰聲不著", "氣憋", "胸悶胸痛", "失眠心悸", "脈弦"]
      },
      {
        "name": "肺虛 ",
        "symptoms": ["喘促短氣", "氣怯聲低", "咳聲低弱", "痰吐稀薄", "自汗畏風", "面潮紅", "舌質淡紅", "脈軟弱"]
      },
      {
        "name": "腎虛 ",
        "symptoms": ["喘促日久", "動則喘甚", "呼多吸少", "氣不得續", "形瘦神憊", "跗腫", "肢冷", "面紅煩躁", "足冷", "汗出如油", "脈微細或細數"]
      }
    ]
  },

  {
    "disease": "肺脹 ",
    "syndromes": [
      {
        "name": "痰濁壅肺 ",
        "symptoms": ["咳嗽痰多", "色白粘膩或呈泡沫", "短氣喘息", "稍勞即著", "怕風易汗", "脘痞納少", "倦怠乏力", "舌質偏淡", "苔薄膩或濁膩", "脈小滑"]
      },
      {
        "name": "痰熱鬱肺 ",
        "symptoms": ["咳逆喘息氣粗", "煩躁", "胸滿", "痰黃或白", "粘稠難咯", "身熱微惡寒", "有汗不多", "溲黃", "便乾", "口渴舌紅", "舌苔黃或黃膩", "脈數或滑數"]
      },
      {
        "name": "痰蒙神竅 ",
        "symptoms": ["神志恍惚", "譫妄", "躁煩不安", "搬空理線", "表情淡漠", "嗜睡", "昏迷", "肢體瞤動", "抽搐", "咳逆喘促", "咯痰不爽", "苔白膩或淡黃膩", "舌質暗紅或淡紫", "脈細滑數"]
      },
      {
        "name": "肺腎氣虛 ",
        "symptoms": ["呼吸淺短難續", "聲低氣怯", "張口抬肩", "倚息不能平臥", "咳嗽", "痰白如沫", "咯吐不利", "胸悶", "心慌", "形寒汗出", "舌淡或黯紫", "脈沉細數無力或結代"]
      },
      {
        "name": "陽虛水泛 ",
        "symptoms": ["面浮", "下肢腫", "甚則一身悉腫", "腹部脹滿有水", "心悸", "喘咳", "咯痰清稀", "脘痞", "納差", "尿少", "怕冷", "面脣青紫", "苔白滑", "舌胖質黯", "脈沉細"]
      }
    ]
  },
  {
    "disease": "肺癆 ",
    "syndromes": [
      {
        "name": "肺陰虧損 ",
        "symptoms": ["乾咳", "咳聲短促", "痰中有時帶血如絲如點", "色鮮紅", "午後手足心熱", "皮膚乾灼", "少量盜汗", "口乾咽燥", "胸部隱隱悶痛", "苔薄", "邊尖質紅", "脈細或兼數"]
      },
      {
        "name": "陰虛火旺 ",
        "symptoms": ["咳嗆氣急", "痰少質粘", "或吐稠黃多量之痰", "時時咯血", "血色鮮紅", "午後潮熱", "骨蒸", "五心煩熱", "顴紅", "盜汗量多", "口渴", "心煩", "失眠", "性急善怒", "胸脅掣痛", "遺精", "月經不調", "形體日漸消瘦", "舌質紅絳而乾", "苔薄黃或剝", "脈細數"]
      },
      {
        "name": "氣陰耗傷 ",
        "symptoms": ["咳嗽無力", "氣短聲低", "痰中偶或夾血", "血色淡紅", "午後潮熱", "熱勢一般不劇", "面色白", "顴紅", "舌質嫩紅", "邊有齒印", "苔薄", "脈細弱而數"]
      },
      {
        "name": "陰陽兩虛 ",
        "symptoms": ["咳逆喘息少氣", "痰中或見夾血", "血色暗淡", "潮熱", "形寒", "自汗", "盜汗", "聲嘶失音", "面浮肢腫", "心慌", "脣紫", "肢冷", "五更腹瀉", "口舌生糜", "大肉盡脫", "滑精", "陽痿", "月經少或閉", "舌光質紅少津", "或舌淡體胖邊有齒印", "脈微細而數或虛大無力"]
      }
    ]
  },
  {
    "disease": "痰飲 ",
    "syndromes": [
      {
        "name": "痰飲-脾陽虛弱 ",
        "symptoms": ["胸脅支滿", "心下痞悶", "胃中有振水音", "脘腹喜溫畏冷", "背寒", "嘔吐清水痰涎", "水入易吐", "口渴不欲飲", "心悸氣短", "頭昏目眩", "食少", "大便或溏", "形體逐漸消瘦", "舌苔白滑", "脈弦細而滑"]
      },
      {
        "name": "痰飲-飲留胃腸 ",
        "symptoms": ["心下堅滿或痛", "自利利後反快", "水走腸間瀝瀝有聲", "腹滿", "便祕", "口舌乾燥", "舌苔膩色白或黃", "脈沉弦或伏"]
      },]
    },
      {
    "disease": "懸飲 ",
    "syndromes": [
      {
        "name": "邪犯胸肺 ",
        "symptoms": ["寒熱往來", "身熱起伏", "汗少", "發熱不惡寒", "咳嗽少痰", "氣急", "胸脅刺痛", "呼吸轉側疼痛加重", "心下痞硬", "乾嘔", "口苦咽乾", "舌苔薄白或黃", "脈弦數"]
      },
      {
        "name": "飲停胸脅 ",
        "symptoms": ["咳唾引痛", "呼吸困難加重", "咳逆氣喘息促不能平臥", "病側肋間脹滿", "偏側胸廓隆起", "舌苔薄白膩", "脈沉弦或弦滑"]
      },
      {
        "name": "絡氣不和 ",
        "symptoms": ["胸脅疼痛", "胸悶不舒", "胸痛如灼", "或感刺痛", "呼吸不暢", "或有悶咳", "舌苔薄", "舌質黯", "脈弦"]
      },
      {
        "name": "陰虛內熱 ",
        "symptoms": ["咳嗆時作", "略吐少量粘痰", "口乾咽燥", "午後潮熱", "顴紅", "心煩", "手足心熱", "盜汗", "形體消瘦", "舌質偏紅", "少苔", "脈小數"]
      },]
    },
       {
    "disease": "溢飲 ",
    "syndromes": [
      {
        "name": "溢飲 ",
        "symptoms": ["身體疼痛而沉重", "甚則肢體浮腫", "惡寒", "無汗", "喘咳", "痰多白沫", "胸悶", "乾嘔", "口不渴", "舌苔白", "脈弦緊"]
      },]
    },
  {
    "disease": "支飲 ",
    "syndromes": [
      {
        "name": "寒飲伏肺 ",
        "symptoms": ["咳逆喘滿不得臥", "痰吐白沫量多", "天冷受寒加重", "面浮跗腫", "背痛", "腰疼", "目泣自出", "身體振振瞤動", "舌苔白滑或白膩", "脈弦緊"]
      },
      {
        "name": "脾腎陽虛 ",
        "symptoms": ["喘促動則為甚", "氣短", "咳而氣怯", "痰多", "食少", "胸悶", "怯寒肢冷", "神疲", "小腹拘急不仁", "臍下悸動", "小便不利", "足跗浮腫", "吐涎沫", "頭目昏眩", "舌苔白潤或灰膩", "舌質胖大", "脈沉細兼滑"]
      }
    ]
  },
  {
    "disease": "汗病 ",
    "syndromes": [
      {
        "name": "肺衛不固 ",
        "symptoms": ["汗出惡風", "稍勞尤甚", "易於感冒", "體倦乏力", "面色少華", "脈細弱", "苔薄白"]
      },
      {
        "name": "營衛不和 ",
        "symptoms": ["汗出惡風", "周身酸楚", "時寒時熱", "或表現半身、某局部出汗", "脈緩", "苔薄白"]
      },
      {
        "name": "陰虛火旺 ",
        "symptoms": ["夜寐盜汗", "或有自汗", "五心煩熱", "或兼午後潮熱", "兩顴色紅", "口渴", "舌紅少苔", "脈細數"]
      },
      {
        "name": "邪熱鬱蒸 ",
        "symptoms": ["蒸蒸汗出", "汗液易粘或衣服黃染", "面赤烘熱", "煩躁", "口苦", "小便色黃", "舌苔薄黃", "脈象弦數"]
      }
    ]
  },

  {
    "disease": "鼻衄 ",
    "syndromes": [
      {
        "name": "熱邪犯肺 ",
        "symptoms": ["鼻燥衄血", "口乾咽燥", "或兼有身熱", "咳嗽痰少等症", "舌質紅", "苔薄", "脈數"]
      },
      {
        "name": "胃熱熾盛 ",
        "symptoms": ["鼻衄", "或兼齒衄", "血色鮮紅", "口渴欲飲", "鼻幹", "口乾臭穢", "煩躁", "便祕", "舌紅", "苔黃", "脈數"]
      },
      {
        "name": "肝火上炎 ",
        "symptoms": ["鼻衄", "頭痛", "目眩", "耳鳴", "煩躁易怒", "兩目紅赤", "口苦", "舌紅", "脈弦數"]
      },
      {
        "name": "氣血虧虛 ",
        "symptoms": ["鼻衄", "或兼齒衄", "肌衄", "神疲乏力", "面色晄白", "頭暈", "耳鳴", "心悸", "夜寐不寧", "舌質淡", "脈細無力"]
      },]
    },

    {
    "disease": "齒衄 ",
    "syndromes": [ 
      {
        "name": "胃火熾盛 ",
        "symptoms": ["齒衄血色鮮紅", "齒齦紅腫疼痛", "頭痛", "口臭", "便祕", "舌紅", "苔黃", "脈洪數"]
      },
      {
        "name": "陰虛火旺 ",
        "symptoms": ["齒衄", "血色淡紅", "常因受熱及煩勞而誘發", "齒搖不堅", "舌紅苔少", "脈細數"]
      },]},

      {
    "disease": "咳血 ",
    "syndromes": [ 
      {
        "name": "燥熱傷肺 ",
        "symptoms": ["喉癢咳嗽", "痰中帶血", "口乾鼻燥", "或有身熱", "舌紅", "少津", "苔薄黃", "脈數"]
      },
      {
        "name": "肝火犯肺 ",
        "symptoms": ["咳嗽陣作", "痰中帶血或純血鮮紅", "胸脅脹痛", "煩躁易怒", "口苦", "舌質紅", "苔薄黃", "脈弦數"]
      },
      {
        "name": "陰虛肺熱 ",
        "symptoms": ["咳嗽痰少", "痰中帶血或反覆咳血", "血色鮮紅", "口乾咽燥", "顴紅", "潮熱盜汗", "舌質紅", "脈細數"]
      },]
    },


     {
    "disease": "吐血 ",
    "syndromes": [ 
      {
        "name": "胃熱壅盛 ",
        "symptoms": ["脘腹脹悶", "甚則作痛", "吐血色紅或紫黯", "常夾有食物殘渣", "口臭", "便祕或大便色黑", "舌紅", "苔黃膩", "脈滑數"]
      },
      {
        "name": "肝火犯胃 ",
        "symptoms": ["吐血色紅或紫黯", "口苦脅痛", "心煩易怒", "寐少夢多", "舌質紅絳", "脈弦數"]
      },
      {
        "name": "氣虛血溢 ",
        "symptoms": ["吐血纏綿不止", "時輕時重", "血色暗淡", "神疲乏力", "心悸氣短", "面色蒼白", "舌質淡", "脈細弱"]
      },]
    },
    {
    "disease": "便血 ",
    "syndromes": [ 
      {
        "name": "腸道濕熱 ",
        "symptoms": ["便血鮮紅", "大便不暢或稀溏", "或有腹痛", "口苦", "苔黃膩", "脈濡數"]
      },
      {
        "name": "脾胃虛寒 ",
        "symptoms": ["便血紫黯", "甚則黑色", "腹部隱痛", "喜熱飲", "面色不華", "神倦懶言", "便溏", "舌質淡", "脈細"]
      },]
    },

   {
    "disease": "尿血 ",
    "syndromes": [ 
      {
        "name": "下焦熱盛 ",
        "symptoms": ["小便黃赤灼熱", "尿血鮮紅", "心煩口渴", "面赤口瘡", "夜寐不安", "舌紅", "脈數"]
      },
      {
        "name": "腎虛火旺 ",
        "symptoms": ["小便短赤帶血", "頭暈耳鳴", "神疲", "顴紅潮熱", "腰膝酸軟", "舌質紅", "脈細數"]
      },
      {
        "name": "脾不統血 ",
        "symptoms": ["久病尿血", "面色不華", "體倦乏力", "氣短聲低", "或兼齒衄", "肌衄", "舌質淡", "脈細弱"]
      },
      {
        "name": "腎氣不固 ",
        "symptoms": ["久病尿血", "色淡紅", "頭暈耳鳴", "精神困憊", "腰脊痠痛", "舌質淡", "脈沉弱"]
      },]
    },
    {
    "disease": "紫斑 ",
    "syndromes": [ 
      {
        "name": "血熱妄行 ",
        "symptoms": ["皮膚出現青紫斑點或斑塊", "或伴有鼻衄", "齒衄", "便血", "尿血", "或有發熱", "口渴", "便祕", "舌紅", "苔黃", "脈弦數"]
      },
      {
        "name": "陰虛火旺 ",
        "symptoms": ["皮膚青紫斑點或斑塊時發時止", "常伴鼻衄", "齒衄或月經過多", "顴紅", "心煩", "口渴", "手足心熱", "或有潮熱", "盜汗", "舌質紅", "苔少", "脈細數"]
      },
      {
        "name": "氣不攝血 ",
        "symptoms": ["久病不愈", "反覆發生肌衄", "神疲乏力", "頭暈目眩", "面色蒼白或萎黃", "食慾不振", "舌質淡", "脈細弱"]
      }
    ]
  },

  {
    "disease": "心悸 ",
    "syndromes": [
      {
        "name": "心虛膽怯 ",
        "symptoms": ["心悸", "善驚易恐", "坐臥不安", "少寐多夢", "舌苔薄白或如常", "脈象動數或虛弦"]
      },
      {
        "name": "心血不足 ",
        "symptoms": ["心悸", "頭暈", "面色不華", "倦怠無力", "舌質淡紅", "脈象細弱"]
      },
      {
        "name": "陰虛火旺 ",
        "symptoms": ["心悸不寧", "心煩少寐", "頭暈目眩", "手足心熱", "耳鳴腰痠", "舌質紅", "少苔或無苔", "脈象細數"]
      },
      {
        "name": "心陽不振 ",
        "symptoms": ["心悸不安", "胸悶氣短", "面色蒼白", "形寒肢冷", "舌質淡白", "脈象虛弱或沉細而數"]
      },
      {
        "name": "水飲凌心 ",
        "symptoms": ["心悸", "眩暈", "胸脘痞滿", "形寒肢冷", "小便短少", "或下肢浮腫", "渴不欲飲", "惡心吐涎", "舌苔白滑", "脈象弦滑"]
      },
      {
        "name": "心血瘀阻 ",
        "symptoms": ["心悸不安", "胸悶不舒", "心痛時作", "或見脣甲青紫", "舌質紫暗或有瘀斑", "脈澀或結代"]
      }
    ]
  },
  {
    "disease": "胸痹 ",
    "syndromes": [
      {
        "name": "心血瘀阻 ",
        "symptoms": ["胸部刺痛", "固定不移", "入夜更甚", "時或心悸不寧", "舌質紫暗", "脈象沉澀"]
      },
      {
        "name": "痰濁壅塞 ",
        "symptoms": ["胸悶如室而痛", "或痛引肩背", "氣短喘促", "肢體沉重", "形體肥胖", "痰多", "苔濁膩", "脈滑"]
      },
      {
        "name": "陰寒凝滯 ",
        "symptoms": ["胸痛徹背", "感寒痛甚", "胸悶氣短", "心悸", "重則喘息", "不能平臥", "面色蒼白", "四肢厥冷", "舌苔白", "脈沉細"]
      },
      {
        "name": "心腎陰虛 ",
        "symptoms": ["胸悶且痛", "心悸盜汗", "心煩不寐", "腰痠膝軟", "耳鳴", "頭暈", "舌紅或有紫斑", "脈細帶數或見細澀"]
      },
      {
        "name": "氣陰兩虛 ",
        "symptoms": ["胸悶隱痛", "時作時止", "心悸氣短", "倦怠懶言", "面色少華", "頭暈目眩", "遇勞則甚", "舌偏紅或有齒印", "脈細弱無力", "或結代"]
      },
      {
        "name": "陽氣虛衰 ",
        "symptoms": ["胸悶氣短", "甚則胸痛徹背", "心悸", "汗出", "畏寒", "肢冷", "腰痠", "乏力", "面色蒼白", "脣甲淡白或青紫", "舌淡白或紫暗", "脈沉細或沉微欲絕"]
      }
    ]
  },
  {
    "disease": "不寐 ",
    "syndromes": [
      {
        "name": "肝鬱化火 ",
        "symptoms": ["不寐", "性情急躁易怒", "不思飲食", "口渴喜飲", "目赤口苦", "小便黃赤", "大便祕結", "舌紅", "苔黃", "脈弦而數"]
      },
      {
        "name": "痰熱內擾 ",
        "symptoms": ["不寐頭重", "痰多胸悶", "惡食", "噯氣", "吞酸惡心", "心煩口苦", "目眩", "苔膩而黃", "脈滑數"]
      },
      {
        "name": "陰虛火旺 ",
        "symptoms": ["心煩不寐", "心悸不安", "頭暈", "耳鳴", "健忘", "腰痠夢遺", "五心煩熱", "口乾津少", "舌紅", "脈細數"]
      },
      {
        "name": "心脾兩虛 ",
        "symptoms": ["多夢易醒", "心悸健忘", "頭暈目眩", "肢倦神疲", "飲食無味", "面色少華", "舌淡", "苔薄", "脈細弱"]
      },
      {
        "name": "心膽氣虛 ",
        "symptoms": ["不寐多夢", "易於驚醒", "膽怯心悸", "遇事善驚", "氣短倦怠", "小便清長", "舌淡", "脈弦細"]
      }
    ]
  },
  {
    "disease": "厥證 ",
    "syndromes": [
      {
        "name": "氣厥-實證 ",
        "symptoms": ["突然昏倒", "不省人事", "口噤拳握", "呼吸氣粗", "或四肢厥冷", "苔薄白", "脈伏或沉弦"]
      },
      {
        "name": "氣厥-虛證 ",
        "symptoms": ["眩暈昏僕", "面色蒼白", "呼吸微弱", "汗出肢冷", "舌質淡", "脈沉微"]
      },
      {
        "name": "血厥-實證 ",
        "symptoms": ["突然昏倒", "不省人事", "牙關緊閉", "面赤脣紫", "舌紅", "脈多沉弦"]
      },
      {
        "name": "血厥-虛證 ",
        "symptoms": ["突然昏厥", "面色蒼白", "口脣無華", "四肢震顫", "目陷口張", "自汗膚冷", "呼吸微弱", "舌質淡", "脈細數無力"]
      },
      {
        "name": "痰厥 ",
        "symptoms": ["突然昏然", "喉有痰聲", "或嘔吐涎沫", "呼吸氣粗", "苔白膩", "脈沉滑"]
      },
      {
        "name": "食厥 ",
        "symptoms": ["暴飲過食之後", "突然昏厥", "氣息窒塞", "脘腹脹滿", "苔厚膩", "脈滑實"]
      }
    ]
  },
  {
    "disease": "鬱證 ",
    "syndromes": [
      {
        "name": "肝氣鬱結 ",
        "symptoms": ["精神抑鬱", "情緒不寧", "善太息", "胸脅脹痛", "痛無定處", "脘悶噯氣", "腹脹納呆", "或嘔吐", "大便失常", "女子月事不行", "苔薄膩", "脈弦"]
      },
      {
        "name": "氣鬱化火 ",
        "symptoms": ["性情急躁易怒", "胸悶脅脹", "嘈雜吞酸", "口乾而苦", "大便祕結", "或頭痛", "目赤", "耳鳴", "舌質紅", "苔黃", "脈弦數"]
      },
      {
        "name": "氣滯痰鬱 ",
        "symptoms": ["咽中不適", "如有物梗阻", "咯之不出", "咽之不下", "胸中窒悶", "或兼脅痛", "苔白膩", "脈弦滑"]
      },
      {
        "name": "憂鬱傷神 ",
        "symptoms": ["精神恍惚", "心神不寧", "悲憂善哭", "時時欠伸", "舌質淡", "苔薄白", "脈弦細"]
      },
      {
        "name": "心脾兩虛 ",
        "symptoms": ["多思善慮", "心悸膽怯", "少寐健忘", "面色不華", "頭暈神疲", "食慾不振", "舌質淡", "脈細弱"]
      },
      {
        "name": "陰虛火旺 ",
        "symptoms": ["眩暈", "心悸", "少寐", "心煩易怒", "或遺精腰痠", "婦女則月經不調", "舌質紅", "脈弦細而數"]
      }
    ]
  },

  {
    "disease": "癲狂 ",
    "syndromes": [
      {
        "name": "痰氣鬱結 ",
        "symptoms": ["精神抑鬱", "表情淡漠", "神志癡呆", "語無倫次", "或喃喃獨語", "喜怒無常", "不思飲食", "舌苔膩", "脈弦滑"]
      },
      {
        "name": "心脾兩虛 ",
        "symptoms": ["神思恍惚", "魂夢顛倒", "心悸易驚", "善悲欲哭", "肢體睏乏", "飲食衰少", "舌色淡", "脈細無力"]
      },
      {
        "name": "狂-痰火上擾 ",
        "symptoms": ["病起急驟", "先有性情急躁", "頭痛失眠", "兩目怒視", "面紅耳赤", "突然狂亂無知", "逾垣上屋", "罵詈叫號", "不避親疏", "或毀物傷人", "氣力逾常", "不食不眠", "舌質紅絳", "苔多黃膩", "脈象弦大滑數"]
      },
      {
        "name": "狂-火盛傷陰 ",
        "symptoms": ["狂病日久其勢漸減", "且有疲憊之象", "多言善驚", "時而煩躁", "形瘦而紅", "舌質紅", "脈細數"]
      }
    ]
  },
  {
    "disease": "癇病 ",
    "syndromes": [
      {
        "name": "風痰閉阻 ",
        "symptoms": ["在發作前常有眩暈", "胸悶", "乏力等症", "發則突然跌倒", "神志不清", "抽搐吐涎", "或伴尖叫與二便失禁", "舌苔白膩", "脈多弦滑"]
      },
      {
        "name": "痰火內盛 ",
        "symptoms": ["發作時昏僕抽搐吐涎", "或有叫吼", "平日情緒急躁", "心煩失眠", "咯痰不爽", "口苦而幹", "便祕", "舌紅苔黃膩", "脈弦滑數"]
      },
      {
        "name": "心腎虧虛 ",
        "symptoms": ["癲癇病發作日久", "健忘", "心悸", "頭暈目眩", "腰膝痠軟", "神疲乏力", "苔薄膩", "脈細弱"]
      }
    ]
  },
  {
    "disease": "胃痛 ",
    "syndromes": [
      {
        "name": "寒邪客胃 ",
        "symptoms": ["胃痛暴作", "惡寒喜暖", "脘腹得溫則痛減", "遇寒則痛增", "口和不渴", "喜熱飲", "苔薄白", "脈弦緊"]
      },
      {
        "name": "飲食停滯 ",
        "symptoms": ["胃痛", "脘腹脹滿", "噯腐吞酸", "或吐不消化食物", "吐食或矢氣後痛減", "或大便不爽", "苔厚膩", "脈滑"]
      },
      {
        "name": "肝氣犯胃 ",
        "symptoms": ["胃脘脹悶", "攻撐作痛", "脘痛連脅", "噯氣頻繁", "大便不暢", "每因情志因素而痛作", "苔多薄白", "脈沉弦"]
      },
      {
        "name": "肝胃鬱熱 ",
        "symptoms": ["胃脘灼痛", "痛勢急迫", "煩躁易怒", "泛酸嘈雜", "口乾口苦", "舌紅苔黃", "脈弦或數"]
      },
      {
        "name": "瘀血停滯 ",
        "symptoms": ["胃脘疼痛", "痛有定處而拒按", "或痛有針刺感", "食後痛甚", "或見吐血便黑", "舌質紫黯", "脈澀"]
      },
      {
        "name": "胃陰虧虛 ",
        "symptoms": ["胃痛隱隱", "口燥咽乾", "大便幹結", "舌紅少津", "脈細數"]
      },
      {
        "name": "脾胃虛寒 ",
        "symptoms": ["胃痛隱隱", "喜溫喜按", "空腹痛甚", "得食痛減", "泛吐清水", "納差", "神疲乏力", "甚則手足不溫", "大便溏薄", "舌淡苔白", "脈虛弱或遲緩"]
      }
    ]
  },
  {
    "disease": "噎嗝 ",
    "syndromes": [
      {
        "name": "痰氣交阻 ",
        "symptoms": ["吞嚥梗阻", "胸膈痞悶", "情志舒暢時可稍減輕", "口乾咽燥", "舌質偏紅", "苔薄膩", "脈弦滑"]
      },
      {
        "name": "津虧熱結 ",
        "symptoms": ["吞嚥梗澀而痛", "固體食物難入", "湯水可下", "形體逐漸消瘦", "口乾咽燥", "大便幹結", "五心煩熱", "舌質紅幹", "或帶裂紋", "脈弦細數"]
      },
      {
        "name": "瘀血內結 ",
        "symptoms": ["胸膈疼痛", "食不得下而復吐出", "甚至水飲難下", "大便堅如羊屎", "或吐出物如赤豆汁", "面色晦滯", "形體更為消瘦", "肌膚枯燥", "舌紅少津", "或帶青紫", "脈細澀"]
      },
      {
        "name": "氣虛陽微 ",
        "symptoms": ["長期飲食不下", "面色晄白", "精神疲憊", "形寒氣短", "泛吐清涎", "面浮", "足腫", "腹脹", "舌淡苔白", "脈細弱"]
      }
    ]
  },
  {
    "disease": "嘔吐 ",
    "syndromes": [
      {
        "name": "外邪犯胃 ",
        "symptoms": ["突然嘔吐", "可伴發熱惡寒", "頭身疼痛", "胸脘滿悶", "苔白膩", "脈濡緩"]
      },
      {
        "name": "飲食停滯 ",
        "symptoms": ["嘔吐酸腐", "脘腹脹滿", "噯氣厭食", "得食愈甚吐後反快", "大便穢臭或溏薄或祕結", "苔厚膩", "脈滑實"]
      },
      {
        "name": "痰飲內阻 ",
        "symptoms": ["嘔吐多為清水痰涎", "脘悶不食", "頭眩心悸", "苔白膩", "脈滑"]
      },
      {
        "name": "肝氣犯胃 ",
        "symptoms": ["嘔吐吞酸", "噯氣頻繁", "胸脅悶痛", "舌邊紅", "苔薄膩", "脈弦"]
      },
      {
        "name": "脾胃虛寒 ",
        "symptoms": ["飲食稍有不慎", "即易嘔吐", "時作時止", "面色晄白", "倦怠乏力", "口乾而不欲飲", "四肢不溫", "大便溏薄", "舌質淡", "脈濡弱"]
      },
      {
        "name": "胃陰不足 ",
        "symptoms": ["嘔吐反復發作", "時作幹嘔", "口燥咽乾", "似飢而不欲食", "舌紅津少", "脈多細數"]
      }
    ]
  },
  {
    "disease": "呃逆 ",
    "syndromes": [
      {
        "name": "胃中寒冷 ",
        "symptoms": ["呃聲沉緩有力", "隔間及胃脘不舒", "得熱則減", "得寒愈甚", "食慾減少", "口中和而不渴", "舌苔白潤", "脈象遲緩"]
      },
      {
        "name": "胃火上逆 ",
        "symptoms": ["呃聲洪亮", "沖逆而出", "口臭煩渴", "喜冷飲", "小便短赤", "大便祕結", "舌苔黃", "脈象滑數"]
      },
      {
        "name": "氣機鬱滯 ",
        "symptoms": ["呃逆連聲", "常因情志不暢而誘發或加重", "伴有胸悶", "納減", "脘脅脹悶", "腸鳴矢氣", "舌苔薄白", "脈象弦"]
      },
      {
        "name": "脾胃陽虛 ",
        "symptoms": ["呃聲低弱無力", "氣不得續", "面色蒼白", "手足不溫", "食少睏倦", "舌淡苔白", "脈象沉細弱"]
      },
      {
        "name": "胃陰不足 ",
        "symptoms": ["呃聲急促而不連續", "口乾舌燥", "煩躁不安", "舌質紅而幹或有裂紋", "脈象細數"]
      }
    ]
  },
  {
    "disease": "泄瀉 ",
    "syndromes": [
      {
        "name": "寒濕/風寒 ",
        "symptoms": ["泄瀉清稀", "甚至如水樣", "腹痛腸鳴", "脘悶食少", "或並有惡寒發熱", "鼻塞頭痛", "肢體痠痛", "苔薄白或白膩", "脈濡緩"]
      },
      {
        "name": "濕熱/暑濕 ",
        "symptoms": ["泄瀉腹痛", "瀉下急迫", "或瀉而不爽", "糞色黃褐而臭", "肛門灼熱", "煩熱口渴", "小便短黃", "舌苔黃膩", "脈濡數或滑數"]
      },
      {
        "name": "食滯腸胃 ",
        "symptoms": ["腹痛腸鳴", "瀉下糞便臭如敗卵", "瀉後痛減", "伴有不消化之物", "脘腹痞滿", "噯腐酸臭", "不思飲食", "舌苔垢濁或厚膩", "脈滑"]
      },
      {
        "name": "肝氣乘脾 ",
        "symptoms": ["平時多有胸脅脹悶", "噯氣食少", "每因抑鬱惱怒或情緒緊張之時", "發生腹痛泄瀉", "舌淡紅", "脈弦"]
      },
      {
        "name": "脾胃虛弱 ",
        "symptoms": ["大便時溏時瀉", "水谷不化", "稍進油膩之物", "則大便次數增多", "飲食減少", "脘腹脹悶不舒", "面色萎黃", "肢倦乏力", "舌淡苔白", "脈細弱"]
      },
      {
        "name": "腎陽虛衰 ",
        "symptoms": ["泄瀉多在黎明之前", "腹部作痛", "腸鳴即瀉", "瀉後則安", "形寒肢冷", "腰膝痠軟", "舌淡苔白", "脈沉細"]
      }
    ]
  },

  {
    "disease": "痢疾 ",
    "syndromes": [
      {
        "name": "濕熱痢 ",
        "symptoms": ["腹痛", "裏急後重", "下痢赤白相雜", "肛門灼熱", "小便短赤", "苔膩後黃", "脈滑數"]
      },
      {
        "name": "疫毒痢 ",
        "symptoms": ["發病急驟", "痢下鮮紫膿血", "腹痛劇烈", "裏急後重較濕熱痢為甚", "或壯熱口渴", "頭痛煩躁", "甚則神昏痙厥", "舌質紅絳", "苔黃燥", "脈滑數"]
      },
      {
        "name": "寒濕痢 ",
        "symptoms": ["痢下赤白粘凍", "白多赤少", "或純為白凍", "伴有腹痛", "裏急後重", "飲食乏味", "胃脘飽悶", "頭身重困", "舌質淡", "苔白膩", "脈濡緩"]
      },
      {
        "name": "陰虛痢 ",
        "symptoms": ["下痢赤白膿血", "或下鮮血粘稠", "臍腹灼痛", "虛坐努責", "食少", "心煩口乾", "舌質紅絳少苔", "或舌光紅乏津", "脈細數"]
      },
      {
        "name": "虛寒痢 ",
        "symptoms": ["下痢稀薄", "帶有白凍", "甚則滑脫不禁", "或腹部隱痛", "食少神疲", "四肢不溫", "腰痠怕冷", "舌淡苔薄白", "脈沉細而弱"]
      },
      {
        "name": "休息痢 ",
        "symptoms": ["下痢時發時止", "日久難愈", "飲食減少", "倦怠怯冷", "嗜臥", "臨廁腹痛裏急", "大便夾有粘液或見赤色", "舌質淡苔膩", "脈濡軟或虛數"]
      },
      {
        "name": "噤口痢-實證 ",
        "symptoms": ["下痢", "胸悶", "嘔逆不食", "口氣穢臭", "舌苔黃膩", "脈滑數"]
      },
      {
        "name": "噤口痢-虛證 ",
        "symptoms": ["下痢","嘔惡不食", "或食入即吐", "口淡不渴", "舌淡", "脈弱"]
      }
    ]
  },
  {
    "disease": "霍亂 ",
    "syndromes": [
      {
        "name": "寒霍亂-輕證 ",
        "symptoms": ["暴起嘔吐下利", "初起時所下帶有稀糞", "繼則下利清稀", "或如米泔水", "不甚臭穢", "腹痛或不痛", "胸膈痞悶", "四肢清冷", "舌苔白膩", "脈象濡弱"]
      },
      {
        "name": "寒霍亂-重證 ",
        "symptoms": ["吐瀉不止", "吐瀉物如米泔汁", "面色蒼白", "眼眶凹陷", "指螺皺癟", "手足厥冷", "頭面出汗", "筋脈攣急", "舌質淡", "苔白", "脈沉微細"]
      },
      {
        "name": "熱霍亂 ",
        "symptoms": ["吐瀉驟作", "嘔吐如噴", "瀉下如米泔汁", "臭穢難聞", "頭痛", "發熱", "口渴", "脘悶心煩", "小便短赤", "腹中絞痛", "甚則轉筋拘攣", "舌苔黃膩", "脈象濡數"]
      },
      {
        "name": "乾霍亂 ",
        "symptoms": ["卒然腹中絞痛", "欲吐不得吐", "欲瀉不得瀉", "煩躁悶亂", "甚則面色青慘", "四肢厥冷", "頭汗出", "脈象沉伏"]
      }
    ]
  },
  {
    "disease": "腹痛 ",
    "syndromes": [
      {
        "name": "寒邪內阻 ",
        "symptoms": ["腹痛急暴", "得溫痛減", "遇冷更甚", "口和不渴", "小便清利", "大便自可或溏薄", "舌苔白膩", "脈象沉緊"]
      },
      {
        "name": "濕熱壅滯 ",
        "symptoms": ["腹痛拒按", "胸悶不舒", "大便祕結或溏滯不爽", "煩渴引飲", "自汗", "小便短赤", "舌苔黃膩", "脈象滑數"]
      },
      {
        "name": "中虛臟寒 ",
        "symptoms": ["腹痛綿綿", "時作時止", "喜熱惡冷", "痛時喜按", "飢餓勞累後更甚", "得食或休息後稍減", "大便溏薄", "兼有神疲", "氣短", "怯寒等證", "舌淡苔白", "脈象沉細"]
      },
      {
        "name": "飲食積滯 ",
        "symptoms": ["脘腹脹滿疼痛", "拒按", "惡食", "噯腐吞酸", "或痛而欲瀉", "瀉後痛減", "或大便祕結", "舌苔膩", "脈滑實"]
      },
      {
        "name": "氣滯血瘀-氣滯為主 ",
        "symptoms": ["脘腹脹悶或痛", "攻竄不定", "痛引少腹", "得噯氣或失氣則脹痛酌減", "遇惱怒則加劇", "脈弦", "苔薄"]
      },
      {
        "name": "氣滯血瘀-血瘀為主 ",
        "symptoms": ["腹痛","痛勢較劇", "痛處不移", "舌質青紫", "脈弦或澀"]
      }
    ]
  },
  {
    "disease": "便祕 ",
    "syndromes": [
      {
        "name": "熱祕 ",
        "symptoms": ["大便幹結", "小便短赤", "面紅身熱", "或兼有腹脹腹痛", "口乾口臭", "舌紅苔黃或黃燥", "脈滑數"]
      },
      {
        "name": "氣祕 ",
        "symptoms": ["大便祕結", "欲便不得", "噯氣頻作", "胸脅痞滿", "甚則腹中脹痛", "納食減少", "舌苔薄膩", "脈弦"]
      },
      {
        "name": "虛祕-氣虛 ",
        "symptoms": ["雖有便意", "臨廁努掙乏力", "掙則汗出短氣", "便後疲乏", "大便並不乾硬", "面色晄白", "神疲氣怯", "舌淡嫩", "苔薄", "脈虛"]
      },
      {
        "name": "虛祕-血虛 ",
        "symptoms": ["大便祕結", "面色無華", "頭暈目眩", "心悸", "脣舌淡", "脈細澀"]
      },
      {
        "name": "冷祕 ",
        "symptoms": ["大便艱澀", "排出困難", "小便清長", "面色晄白", "四肢不溫", "喜熱怕冷", "腹中冷痛", "或腰脊酸冷", "舌淡苔白", "脈沉遲"]
      }
    ]
  },
  {
    "disease": "蟲證 ",
    "syndromes": [
      {
        "name": "蛔蟲病 ",
        "symptoms": ["臍周腹痛", "時作時止", "胃脘嘈雜", "甚或吐蟲", "便蟲", "腹中蟲積", "不思飲食", "面黃肌瘦", "鼻孔作癢", "睡中齡齒流涎"]
      },
      {
        "name": "膽道蛔蟲病 ",
        "symptoms": ["突然發作的胃脘及右脅部劇烈疼痛", "痛引背心及右肩", "劇痛時彎腰曲膝", "輾轉不安", "惡心嘔吐", "並常有蛔蟲吐出", "痛止則如常人"]
      },
      {
        "name": "脾虛濕滯  - 鉤蟲病",
        "symptoms": ["面色萎黃或面黃而虛浮", "善食易飢", "食後腹脹", "或異嗜生米、茶葉、木炭之類", "神疲肢軟", "舌淡苔薄", "脈濡"]
      },
      {
        "name": "氣血兩虧  - 鉤蟲病",
        "symptoms": ["顏面、肌膚萎黃或蒼白", "面足甚至全身浮腫", "脘悶不舒", "倦怠乏力", "精神不振", "眩暈耳鳴", "心悸氣短", "舌質淡胖", "脈弱"]
      },
      {
        "name": "蟯蟲病 ",
        "symptoms": ["肛門發癢", "夜間尤甚", "睡眠不安", "久病則出現納減", "腹痛", "腹瀉", "消瘦等症"]
      },
      {
        "name": "薑片蟲病 ",
        "symptoms": ["輕度腹痛", "腹瀉或惡心嘔吐", "甚者可見精神倦怠", "或腹服浮腫"]
      }
    ]
  },
  {
    "disease": "脅痛 ",
    "syndromes": [
      {
        "name": "肝氣鬱結 ",
        "symptoms": ["脅痛以脹痛為主", "走竄不定", "疼痛每因情志而增減", "胸悶氣短", "飲食減少", "噯氣頻作", "苔薄", "脈弦"]
      },
      {
        "name": "瘀血停著 ",
        "symptoms": ["脅肋刺痛", "痛有定處", "入夜更甚", "脅肋下或見癥塊", "舌質紫暗", "脈象沉澀"]
      },
      {
        "name": "肝膽濕熱 ",
        "symptoms": ["脅痛口苦", "胸悶納呆", "惡心嘔吐", "目赤或目黃、身黃、小便黃赤", "舌苔黃膩", "脈弦滑數"]
      },
      {
        "name": "肝陰不足 ",
        "symptoms": ["脅肋隱痛", "悠悠不休", "遇勞加重", "口乾咽燥", "心中煩熱", "頭暈目眩", "舌紅少苔", "脈細弦而數"]
      }
    ]
  },
  {
    "disease": "黃疸 ",
    "syndromes": [
      {
        "name": "陽黃-熱重於濕 ",
        "symptoms": ["身目俱黃", "黃色鮮明", "發熱口渴", "或見心中懊憹", "腹部脹滿", "口乾而苦", "惡心欲吐", "小便短少黃赤", "大便祕結", "舌苔黃膩", "脈象弦數"]
      },
      {
        "name": "陽黃-濕重於熱 ",
        "symptoms": ["身目俱黃", "但不如前者鮮明", "頭重身困", "胸脘痞滿", "食慾減退", "惡心嘔吐", "腹脹", "或大便溏垢", "舌苔厚膩微黃", "脈象弦滑或濡緩"]
      },
      {
        "name": "急黃 ",
        "symptoms": ["發病急驟", "黃疸迅速加深", "其色如金", "高熱煩渴", "脅痛腹滿", "神昏譫語", "或見衄血、便血", "或肌膚出現瘀斑", "舌質紅絳", "苔黃而燥", "脈弦滑數或細數"]
      },
      {
        "name": "陰黃 ",
        "symptoms": ["身目俱黃", "黃色晦暗", "或如煙燻", "納少脘悶", "或見腹脹", "大便不實", "神疲畏寒", "口淡不渴", "舌質淡苔膩", "脈減緩或沉遲"]
      }
    ]
  },
  {
    "disease": "積聚 ",
    "syndromes": [
      {
        "name": "聚證-肝氣鬱滯 ",
        "symptoms": ["腹中氣聚", "攻竄脹痛", "時聚時散", "脘脅之間時或不適", "苔薄", "脈弦"]
      },
      {
        "name": "聚證-食滯痰阻 ",
        "symptoms": ["腹脹或痛", "便祕", "納呆", "時有如條狀物聚起在腹部", "重按則脹痛更甚", "舌苔膩", "脈弦滑"]
      },
      {
        "name": "積證-氣滯血阻 ",
        "symptoms": ["積塊軟而不堅", "固着不移", "脹痛並見", "舌苔薄", "脈弦"]
      },
      {
        "name": "積證-瘀血內結 ",
        "symptoms": ["腹部積塊明顯", "硬痛不移", "面黯消瘦", "納減乏力", "時有寒熱", "女子或見月事不下", "舌苔薄邊略或質紫或見瘀點", "脈細澀"]
      },
      {
        "name": "積證-正虛瘀結 ",
        "symptoms": ["積塊堅硬", "疼痛逐漸加劇", "面色萎黃或黧黑", "消瘦脫形", "飲食大減", "舌質淡紫", "舌光無苔", "脈細數或弦細"]
      }
    ]
  },
  {
    "disease": "鼓脹 ",
    "syndromes": [
      {
        "name": "氣滯濕阻 ",
        "symptoms": ["腹脹按之不堅", "脅下脹滿或疼痛", "飲食減少", "食後作脹", "噯氣不適", "小便短少", "舌苔白膩", "脈弦"]
      },
      {
        "name": "寒濕困脾 ",
        "symptoms": ["腹大脹滿", "按之如囊裹水", "甚則顏面微浮", "下肢浮腫", "脘腹痞脹", "得熱稍舒", "精神睏倦", "怯寒懶動", "小便少", "大便溏", "舌苔白膩", "脈緩"]
      },
      {
        "name": "濕熱蘊結 ",
        "symptoms": ["腹大堅滿", "脘腹撐急", "煩熱口苦", "渴不欲飲", "小便赤澀", "大便祕結或溏垢", "舌邊尖紅", "苔黃膩或兼灰黑", "脈象弦數", "或有面目皮膚發黃"]
      },
      {
        "name": "肝脾血瘀 ",
        "symptoms": ["腹大堅滿", "脈絡怒張", "脅腹刺痛", "面色黯黑", "面頸胸臂有血痣", "手掌赤痕", "脣色紫褐", "口渴", "飲水不能下", "大便色黑", "舌質紫紅或有紫斑", "脈細澀或伏"]
      },
      {
        "name": "脾腎陽虛 ",
        "symptoms": ["腹大脹滿不舒", "早寬容急", "面色蒼黃", "或呈晄白", "脘悶納呆", "神倦怯寒", "肢冷或下肢浮腫", "小便短少不利", "舌質胖淡紫", "脈沉弦無力"]
      },
      {
        "name": "肝腎陰虛 ",
        "symptoms": ["腹大脹滿", "或見青筋暴露", "面色晦滯", "脣紫", "口燥", "心煩", "失眠", "牙宣出血", "鼻時衄血", "小便短少", "舌質紅絳少津", "脈弦細數"]
      }
    ]
  },

  {
    "disease": "頭痛 ",
    "syndromes": [
      {
        "name": "風寒頭痛 ",
        "symptoms": ["頭痛時作", "痛連項背", "惡風畏寒", "遇風尤劇", "口不渴", "苔薄白", "脈浮"]
      },
      {
        "name": "風熱頭痛 ",
        "symptoms": ["頭痛而脹", "甚則頭痛如裂", "發熱或惡風", "面紅目赤", "口渴欲飲", "便祕溲黃", "舌質紅", "苔黃", "脈浮數"]
      },
      {
        "name": "風溼頭痛 ",
        "symptoms": ["頭痛如裹", "肢體困重", "納呆胸悶", "小便不利", "大便或溏", "苔白膩", "脈濡"]
      },
      {
        "name": "肝陽頭痛 ",
        "symptoms": ["頭痛而眩", "心煩易怒", "夜眠不寧", "或兼脅痛", "面紅口苦", "苔薄黃", "脈弦有力"]
      },
      {
        "name": "腎虛頭痛 ",
        "symptoms": ["頭痛且空", "每兼眩暈", "腰痛痠軟", "神疲乏力", "遺精帶下", "耳鳴少寐", "舌紅少苔", "脈細無力"]
      },
      {
        "name": "血虛頭痛 ",
        "symptoms": ["頭痛而暈", "心悸不寧", "神疲乏力", "面色晄白", "舌質淡苔薄白", "脈細弱"]
      },
      {
        "name": "痰濁頭痛 ",
        "symptoms": ["頭痛昏蒙", "胸脘滿悶", "嘔惡痰涎", "苔白膩", "脈滑或弦滑"]
      },
      {
        "name": "瘀血頭痛 ",
        "symptoms": ["頭痛經久不愈", "痛處固定不移", "痛如錐刺", "或有頭部外傷史", "舌質紫", "苔薄白", "脈細或細澀"]
      }
    ]
  },
  {
    "disease": "眩暈 ",
    "syndromes": [
      {
        "name": "肝陽上亢 ",
        "symptoms": ["眩暈耳鳴", "頭痛且脹", "每因煩勞或惱怒而頭暈、頭痛加劇", "面時潮紅", "急躁易怒", "少寐多夢", "口苦", "舌質紅", "苔黃", "脈弦"]
      },
      {
        "name": "氣血虧虛 ",
        "symptoms": ["眩暈動則加劇", "勞累即發", "面色晄白", "脣甲不華", "髮色不澤", "心悸少寐", "神疲懶言", "飲食減少", "舌質淡", "脈細弱"]
      },
      {
        "name": "腎精不足 ",
        "symptoms": ["眩暈而見精神萎靡", "少寐多夢", "健忘", "腰膝痠軟", "遺精", "耳鳴"]
      },
      {
        "name": "痰濁中阻 ",
        "symptoms": ["眩暈而見頭重如蒙", "胸悶噁心", "食少多寐", "苔白膩", "脈濡滑"]
      }
    ]
  },
  {
    "disease": "中風 ",
    "syndromes": [
      {
        "name": "中經絡-絡脈空虛,風邪入中 ",
        "symptoms": ["肌膚不仁", "手足麻木", "突然口眼喎斜", "語言不利", "口角流涎", "甚則半身不遂", "或兼見惡寒", "發熱", "肢體拘急", "關節痠痛等症", "苔薄白", "脈浮數"]
      },
      {
        "name": "中經絡-肝腎陰虛,風陽上擾 ",
        "symptoms": ["平素頭暈頭痛", "耳鳴目眩", "少寐多夢", "突然發生口眼喎斜", "舌強語塞", "或手足重滯", "甚則半身不遂等症", "舌質紅或苔膩", "脈弦細數或弦滑"]
      },
      {
        "name": "中臟腑-閉證-陽閉 ",
        "symptoms": ["突然昏僕", "不省人事", "牙關緊閉", "口噤不開", "兩手握固", "大小便閉", "肢體強痙", "面赤身熱", "氣粗口臭", "躁擾不寧", "苔黃膩", "脈弦滑而數"]
      },
      {
        "name": "中臟腑-閉證-陰閉 ",
        "symptoms": ["突然昏僕", "不省人事", "牙關緊閉", "口噤不開", "兩手握固", "大小便閉", "肢體強痙", "面白脣暗", "靜臥不煩", "四肢不溫", "痰涎雍盛", "苔白膩", "脈沉滑緩"]
      },
      {
        "name": "中臟腑-脫證 ",
        "symptoms": ["突然昏僕", "不省人事", "目合口張", "鼻鼾息微", "手撒肢冷", "汗多", "大小便自遺", "肢體軟癱", "舌痿", "脈細弱或脈微欲絕"]
      },
      {
        "name": "後遺證-半身不遂-氣虛血滯 ",
        "symptoms": ["半身不遂", "肢軟無力", "患側手足浮腫", "語言蹇澀", "口眼喎斜", "面色萎黃", "或暗淡無華", "苔薄白", "舌淡紫", "或舌體不正", "脈細澀無力"]
      },
      {
        "name": "後遺證-半身不遂-肝陽上亢,脈絡瘀阻 ",
        "symptoms": ["患側僵硬拘攣", "兼見頭痛頭暈", "面赤耳鳴", "舌紅絳", "苔薄黃", "脈弦硬有力"]
      },
      {
        "name": "後遺證-語言不利-風痰阻絡 ",
        "symptoms": ["舌強語塞", "肢體麻木", "脈弦滑"]
      },
      {
        "name": "後遺證-語言不利-腎虛精虧 ",
        "symptoms": ["音暗失語", "心悸", "氣短及腰膝痠軟"]
      },

    ]
  },
  {
    "disease": "痙病 ",
    "syndromes": [
      {
        "name": "邪壅經絡 ",
        "symptoms": ["頭痛", "項背強直", "惡寒發熱", "肢體酸重", "苔白膩", "脈浮緊"]
      },
      {
        "name": "熱甚發痙 ",
        "symptoms": ["發熱胸悶", "口噤齡齒", "項背強直", "甚至角弓反張", "手足攣急", "腹脹便祕", "咽乾口渴", "心煩急躁", "甚則神昏譫語", "苔黃膩", "脈弦數"]
      },
      {
        "name": "陰血虧虛 ",
        "symptoms": ["項背強急", "四肢抽搐", "頭目昏眩", "自汗", "神疲", "氣短", "舌淡紅", "脈弦細"]
      }
    ]
  },
  {
    "disease": "癭病 ",
    "syndromes": [
      {
        "name": "氣鬱痰阻 ",
        "symptoms": ["頸前正中腫大", "質軟不痛", "頸部覺脹", "胸悶", "喜太息", "或兼胸脅竄痛", "病情的波動常與情志因素有關", "苔薄白", "脈弦"]
      },
      {
        "name": "痰結血瘀 ",
        "symptoms": ["頸前出現腫塊", "按之較硬或有結節", "腫塊經久未消", "胸悶", "納差", "苔薄白或白膩", "脈弦或澀"]
      },
      {
        "name": "肝火旺盛 ",
        "symptoms": ["頸前輕度或中度腫大", "一般柔軟、光滑", "煩熱", "容易出汗", "性情急躁易怒", "眼球突出", "手指顫抖", "面部烘熱", "口苦", "舌質紅", "苔薄黃", "脈弦數"]
      },
      {
        "name": "心肝陰虛 ",
        "symptoms": ["癭腫或大或小", "質軟", "病起較緩", "心悸不寧", "心煩少寐", "易出汗", "手指顫動", "眼乾", "目眩", "倦怠乏力", "舌質紅", "舌體顫動", "脈弦細數"]
      }
    ]
  },
  {
    "disease": "瘧疾 ",
    "syndromes": [
      {
        "name": "正瘧 ",
        "symptoms": ["寒戰壯熱", "休作有時", "先有呵欠乏力", "繼則寒慄鼓頜", "寒罷則內外皆熱", "頭痛面赤", "口渴引飲", "終則遍身汗出", "熱退身涼", "舌紅", "苔薄白或黃膩", "脈弦"]
      },
      {
        "name": "溫瘧 ",
        "symptoms": ["熱多寒少", "汗出不暢", "頭痛", "骨節痠疼", "口渴引飲", "便祕尿赤", "舌紅", "苔黃", "脈弦數"]
      },
      {
        "name": "寒瘧 ",
        "symptoms": ["熱少寒多", "口不渴", "胸脘痞悶", "神疲體倦", "苔白膩", "脈弦"]
      },
      {
        "name": "熱瘴 ",
        "symptoms": ["熱甚寒微", "或壯熱不寒", "頭痛", "肢體煩疼", "面紅耳赤", "胸悶嘔吐", "煩渴飲冷", "大便祕結", "小便熱赤", "甚至神昏譫語", "舌質紅絳", "苔黃膩或垢黑", "脈洪數或弦數"]
      },
      {
        "name": "冷瘴 ",
        "symptoms": ["寒甚熱微", "或但寒不熱", "或嘔吐腹瀉", "甚則神昏不語", "苔白厚膩", "脈弦"]
      },
      {
        "name": "勞瘧 ",
        "symptoms": ["倦怠乏力", "短氣懶言", "食少", "面色萎黃", "形體消瘦", "遇勞則復發瘧疾", "寒熱時作", "舌質淡", "脈細無力"]
      }
    ]
  },
 {
  "disease": "水腫",
  "syndromes": [
    {
      "name": "風水泛濫",
      "symptoms": ["眼瞼浮腫", "四肢及全身皆腫", "來勢迅速", "惡寒發熱", "肢節酸楚", "小便不利", "*咽喉紅腫疼痛" ,"舌質紅", "脈浮滑數","*或見咳喘,苔薄白,脈浮滑或緊"]
    },
    {
      "name": "濕毒侵淫",
      "symptoms": ["眼瞼浮腫延及全身", "小便不利", "身發瘡痍甚至潰爛", "惡風發熱", "舌質紅", "苔薄黃", "脈浮數或滑數"]
    },
    {
      "name": "水濕浸漬",
      "symptoms": ["全身水腫", "按之沒指", "小便短少", "身體困重", "胸悶", "納呆", "泛惡", "苔白膩", "脈沉緩"]
    },
    {
      "name": "濕熱壅盛",
      "symptoms": ["遍體浮腫", "皮膚繃急光亮", "胸脘痞悶", "煩熱口渴", "小便短赤", "大便干結", "苔黃膩", "脈沉數或濡數"]
    },
    {
      "name": "脾陽虛衰",
      "symptoms": ["身腫腰以下為甚", "按之凹陷不易恢復", "脘腹脹悶", "納減便溏", "面色萎黃", "神倦肢冷", "小便短少", "舌質淡", "苔白膩", "脈沉緩"]
    },
    {
      "name": "腎氣衰微",
      "symptoms": ["面浮身腫", "腰以下尤甚", "按之凹陷不起", "心悸", "氣促", "腰部冷痛酸重", "尿量減少或增多", "四肢厥冷", "怯寒神疲", "面色灰滯或恍白", "舌質淡胖", "脈沉細"]
    }
  ]
},


  {
    "disease": "淋證 ",
    "syndromes": [
      {
        "name": "熱淋 ",
        "symptoms": ["小便短數", "灼熱刺痛", "溺色黃赤", "少腹拘急脹痛", "或有寒熱", "口苦", "嘔惡", "或有腰痛拒按", "或有大便祕結", "苔黃膩", "脈滑數"]
      },
      {
        "name": "石淋 ",
        "symptoms": ["尿中時挾砂石", "小便艱澀", "或排尿時突然中斷", "尿道窘迫疼痛", "少腹拘急", "或腰腹絞痛難忍", "尿中帶血", "舌紅", "苔薄黃", "脈弦或帶數"]
      },
      {
        "name": "氣淋-實證 ",
        "symptoms": ["小便澀滯", "淋瀝不宜", "少腹滿痛", "苔薄白", "脈多沉弦"]
      },
      {
        "name": "氣淋-虛證 ",
        "symptoms": ["少腹墜脹", "尿有餘瀝", "面色晄白", "舌質淡", "脈虛細無力"]
      },
      {
        "name": "血淋-實證 ",
        "symptoms": ["小便熱澀刺痛", "尿色深紅", "或挾有血塊", "疼痛滿急加劇", "或見心煩", "苔黃", "脈滑數"]
      },
      {
        "name": "血淋-虛證 ",
        "symptoms": ["尿色淡紅", "尿痛澀滯不顯著", "腰痠膝軟", "神疲乏力", "舌淡紅", "脈細數"]
      },
      {
        "name": "膏淋-實證 ",
        "symptoms": ["小便混濁如米泔水", "置之沉澱如絮狀", "上有浮油如脂", "或夾有凝塊", "或混有血液", "尿道熱澀疼痛", "舌紅", "苔黃膩", "脈滑數"]
      },
      {
        "name": "膏淋-虛證 ",
        "symptoms": ["病久不已", "反覆發作", "淋出如脂", "澀痛反見減輕", "但形體日漸消瘦", "頭昏無力", "腰痠膝軟", "舌淡", "苔膩", "脈細弱無力"]
      },
      {
        "name": "勞淋 ",
        "symptoms": ["小便不甚赤澀", "但淋瀝不已", "時作時止", "遇勞即發", "腰痠膝軟", "神疲乏力", "舌質淡", "脈虛弱"]
      }
    ]
  },
  {
    "disease": "癃閉 ",
    "syndromes": [
      {
        "name": "膀胱溼熱 ",
        "symptoms": ["小便點滴不通", "或量極少而短赤灼熱", "小腹脹滿", "口苦口粘", "或口渴不欲飲", "或大便不暢", "苔根黃膩", "舌質紅", "脈數"]
      },
      {
        "name": "肺熱壅盛 ",
        "symptoms": ["小便涓滴不通", "或點滴不爽", "咽乾", "煩渴欲飲", "呼吸短促", "或有咳嗽", "苔薄黃", "脈數"]
      },
      {
        "name": "肝鬱氣滯 ",
        "symptoms": ["情志抑鬱", "或多煩善怒", "小便不通或通而不暢", "脅腹脹滿", "苔薄或薄黃", "舌紅", "脈弦"]
      },
      {
        "name": "尿路阻塞 ",
        "symptoms": ["小便點滴而下", "或尿如細線", "甚則阻塞不通", "小腹脹滿疼痛", "舌質紫暗", "或有瘀點", "脈澀"]
      },
      {
        "name": "中氣不足 ",
        "symptoms": ["小腹墜脹", "時欲小便而不得出", "或量少而不暢", "精神疲乏", "食慾不振", "氣短而語聲低細", "舌質淡", "苔薄", "脈細弱"]
      },
      {
        "name": "腎陽衰憊 ",
        "symptoms": ["小便不通或點滴不爽", "排出無力", "面色晄白", "神氣怯弱", "畏寒", "腰膝冷而痠軟無力", "舌質淡", "苔白", "脈沉細而尺弱"]
      }
    ]
  },
  {
    "disease": "腰痛 ",
    "syndromes": [
      {
        "name": "寒溼腰痛 ",
        "symptoms": ["腰部冷痛重着", "轉側不利", "逐漸加重", "靜臥痛不減", "遇陰雨天則加重", "苔白膩", "脈沉而遲緩"]
      },
      {
        "name": "溼熱腰痛 ",
        "symptoms": ["腰部弛痛", "痛處伴有熱感", "熱天或雨天疼痛加重", "而活動後或可減輕", "小便短赤", "苔黃膩", "脈濡數或弦數"]
      },
      {
        "name": "瘀血腰痛 ",
        "symptoms": ["腰痛如刺", "痛有定處", "日輕夜重", "證輕者俯仰不便", "重則不能轉側", "痛處拒按", "舌質暗紫", "或有瘀斑", "脈澀", "部分病人有外傷史"]
      },
      {
        "name": "腎虛腰痛-偏陽虛 ",
        "symptoms": ["腰痛以疲軟爲主", "喜按喜揉", "腿膝無力", "遇勞更甚", "臥則減輕", "常反覆發作", "少腹拘急", "面色晄白", "手足不溫", "少氣乏力", "舌淡", "脈沉細"]
      },
      {
        "name": "腎虛腰痛-偏陰虛 ",
        "symptoms": ["腰痛以疲軟爲主", "喜按喜揉", "腿膝無力", "遇勞更甚", "臥則減輕", "常反覆發作", "心煩失眠", "口燥咽乾", "面色潮紅", "手足心熱", "舌紅少苔", "脈弦細數"]
      }
    ]
  },
  {
    "disease": "消渴 ",
    "syndromes": [
      {
        "name": "上消-肺熱津傷 ",
        "symptoms": ["煩渴多飲", "口乾舌燥", "尿頻量多", "舌邊尖紅", "苔薄黃", "脈洪數"]
      },
      {
        "name": "中消-胃熱熾盛 ",
        "symptoms": ["多食易飢", "形體消瘦", "大便乾燥", "苔黃", "脈滑實有力"]
      },
      {
        "name": "下消-腎陰虧虛 ",
        "symptoms": ["尿頻量多", "混濁如脂膏", "或尿甜", "口乾脣燥", "舌紅", "脈沉細數"]
      },
      {
        "name": "下消-陰陽兩虛 ",
        "symptoms": ["小便頻數", "混濁如膏", "甚至飲一洩一", "面色黧黑", "耳輪焦乾", "腰膝痠軟", "形寒畏冷", "陽萎不舉", "舌淡苔白", "脈沉細無力"]
      }
    ]
  },
  {
    "disease": "遺精 ",
    "syndromes": [
      {
        "name": "君相火動,心腎不交 ",
        "symptoms": ["少寐多夢", "夢則遺精", "伴有心中煩熱", "頭暈", "目眩", "精神不振", "體倦乏力", "心悸", "怔忡", "善恐健忘", "口乾", "小溲短赤", "舌紅", "脈細數"]
      },
      {
        "name": "溼熱下注,擾動精室 ",
        "symptoms": ["遺精頻作", "或尿時少量精液外流", "小溲熱赤渾濁", "或澀不爽", "口苦或渴", "心煩少寐", "口舌生瘡", "大便常溏臭", "後重不爽", "或見脘腹痞悶", "噁心", "苔黃膩", "脈滑數"]
      },
      {
        "name": "勞傷心脾,氣不攝精 ",
        "symptoms": ["心悸怔忡", "失眠健忘", "面色萎黃", "四肢睏倦", "食少便溏", "勞則遺精", "苔薄", "質淡", "脈弱"]
      },
      {
        "name": "腎虛滑脫,精關不固 ",
        "symptoms": ["夢遺頻作", "甚至滑精", "腰膝痠軟", "咽乾", "心煩", "眩暈", "耳鳴", "健忘", "失眠", "低熱顴赤", "形瘦", "盜汗", "發落齒搖", "舌紅少苔", "脈細數"]
      }
    ]
  },
  {
    "disease": "陽痿 ",
    "syndromes": [
      {
        "name": "命火衰微 ",
        "symptoms": ["陽痿", "面色晄白", "頭暈目眩", "精神萎靡", "腰膝痠軟", "舌淡苔白", "脈多沉細"]
      },
      {
        "name": "心脾受損 ",
        "symptoms": ["陽痿", "精神不振", "夜寐不安", "面色不華", "苔薄膩", "舌質淡", "脈細"]
      },
      {
        "name": "恐懼傷腎 ",
        "symptoms": ["陽痿", "精神苦悶", "膽怯多疑", "心悸", "失眠", "脈弦細", "苔薄膩", "或見舌質淡青"]
      },
      {
        "name": "溼熱下注 ",
        "symptoms": ["陽痿", "小便短赤", "下肢酸困", "苔黃", "脈沉滑", "或濡滑而數"]
      }
    ]
  },

  {
    "disease": "耳鳴耳聾 ",
    "syndromes": [
      {
        "name": "肝膽火盛 ",
        "symptoms": ["突然耳鳴或耳聾", "頭痛面赤", "口苦咽乾", "心煩易怒", "怒則更甚", "或夜寐不安", "胸脅脹悶", "大便祕結", "小溲短赤"]
      },
      {
        "name": "痰火鬱結 ",
        "symptoms": ["兩耳蟬鳴", "時輕時重", "有時閉塞如聾", "胸中煩悶", "痰多", "口苦", "或脅痛", "喜得太息", "耳下脹痛", "二便不暢"]
      },
      {
        "name": "風熱上擾 ",
        "symptoms": ["外感熱病中", "出現耳鳴或耳聾", "伴見頭痛", "眩暈", "嘔逆", "心中煩悶", "耳內作癢", "或兼寒熱身痛等表證"]
      },
      {
        "name": "腎精虧虛 ",
        "symptoms": ["耳鳴或耳聾", "多兼見眩暈", "腰膝軟", "顴赤口乾", "手足心熱", "遺精等"]
      },
      {
        "name": "清氣不升 ",
        "symptoms": ["耳鳴", "耳聾", "時輕時重", "休息暫減", "煩勞則加", "四肢睏倦", "勞怯神疲", "昏憤食少", "大便溏薄"]
      }
    ]
  },
  {
    "disease": "痹證 ",
    "syndromes": [
      {
        "name": "行痹  - 風邪偏盛",
        "symptoms": ["肢體關節痠痛", "遊走不定", "關節屈伸不利", "或見惡風發熱"]
      },
      {
        "name": "痛痹  - 寒邪偏盛",
        "symptoms": ["肢體關節疼痛較劇", "痛有定處", "得熱痛減", "遇寒痛增", "關節不可屈伸", "局部皮色不紅", "觸之不熱"]
      },
      {
        "name": "着痹  - 溼邪偏盛",
        "symptoms": ["肢體關節重着", "痠痛", "或有腫脹", "痛有定處", "手足沉重", "活動不便", "肌膚麻木不仁"]
      },
      {
        "name": "風溼熱痹 ",
        "symptoms": ["關節疼痛", "局部灼熱紅腫", "得冷稍舒", "痛不可觸", "可病及一個或多個關節", "多兼有發熱", "惡風", "口渴", "煩悶不安等全身症狀"]
      }
    ]
  },
  {
    "disease": "痿證 ",
    "syndromes": [
      {
        "name": "肺熱津傷 ",
        "symptoms": ["病起發熱", "或熱後突然出現肢體軟弱無力", "皮膚枯燥", "心煩口渴", "咳嗆少痰", "咽乾不利", "小便黃少", "大便乾燥"]
      },
      {
        "name": "溼熱浸淫 ",
        "symptoms": ["四肢痿軟", "身體困重", "或麻木", "微腫", "尤以下肢多見", "或足脛熱氣上騰", "或有發熱", "胸痞脘悶", "小便短赤澀痛"]
      },
      {
        "name": "脾胃虧虛 ",
        "symptoms": ["肢體痿軟無力", "逐漸加重", "食少", "便溏", "腹脹", "面浮而色不華", "氣短", "神疲乏力"]
      },
      {
        "name": "肝腎虧損 ",
        "symptoms": ["起病緩慢", "下肢痿軟無力", "腰脊痠軟", "不能久立", "或伴目眩發落", "咽乾耳鳴", "遺精或遺尿", "或婦女月經不調", "甚至步履全廢", "腿脛大肉漸脫"]
      }
    ]
  },
  {
    "disease": "內傷發熱 ",
    "syndromes": [
      {
        "name": "肝鬱發熱 ",
        "symptoms": ["時覺身熱心煩", "熱勢常隨情緒波動而起伏", "精神抑鬱或煩躁易怒", "胸脅脹悶", "喜嘆息", "口苦而幹", "婦女常兼月經不調", "經來腹痛", "或乳房發脹"]
      },
      {
        "name": "瘀血發熱 ",
        "symptoms": ["午後或夜晚發熱", "或自覺身體某些局部發熱", "口乾咽燥而不欲飲", "軀幹或四肢有固定痛處或腫塊", "甚或肌膚甲錯", "面色萎黃或黯黑"]
      },
      {
        "name": "氣虛發熱 ",
        "symptoms": ["發熱常在勞累後發生或加劇", "熱勢或低或高", "頭暈乏力", "氣短懶言", "自汗", "易於感冒", "食少便溏"]
      },
      {
        "name": "血虛發熱 ",
        "symptoms": ["發熱多爲低熱", "頭暈眼花", "身倦乏力", "心悸不寧", "面白少華", "脣甲色淡"]
      },
      {
        "name": "陰虛發熱 ",
        "symptoms": ["午後或夜間發熱", "手足心發熱", "或骨蒸潮熱", "心煩", "少寐", "多夢", "顴紅", "盜汗", "口乾咽燥", "大便乾結", "尿少色黃"]
      }
    ]
  },
  {
    "disease": "虛勞 ",
    "syndromes": [
      {
        "name": "氣虛-肺氣虛 ",
        "symptoms": ["短氣自汗", "聲音低怯", "時寒時熱", "平素易於感冒", "面白"]
      },
      {
        "name": "氣虛-脾氣虛 ",
        "symptoms": ["飲食減少", "食後胃脘不舒", "倦怠乏力", "大便溏薄", "面色萎黃"]
      },
      {
        "name": "血虛-心血虛 ",
        "symptoms": ["心悸怔忡", "健忘", "失眠", "多夢", "面色不華"]
      },
      {
        "name": "血虛-肝血虛 ",
        "symptoms": ["頭暈", "目眩", "脅痛", "肢體麻木", "筋脈拘急", "或驚惕肉瞤", "婦女月經不調甚則經閉", "面色不華"]
      },
      {
        "name": "陰虛-肺陰虛 ",
        "symptoms": ["乾咳", "咽燥", "咳血", "甚或失音", "潮熱", "盜汗", "面色潮紅"]
      },
      {
        "name": "陰虛-心陰虛 ",
        "symptoms": ["心悸", "失眠", "煩躁", "潮熱", "盜汗", "或口舌生瘡", "面色潮紅"]
      },
      {
        "name": "陰虛-脾胃陰虛 ",
        "symptoms": ["口乾脣燥", "不思飲食", "大便燥結", "甚則乾嘔", "呃逆", "面色潮紅"]
      },
      {
        "name": "陰虛-肝陰虛 ",
        "symptoms": ["頭痛", "眩暈", "耳鳴", "目幹畏光", "視物不明", "急躁易怒", "或肢體麻木", "筋惕肉瞤", "面潮紅"]
      },
      {
        "name": "陰虛-腎陰虛 ",
        "symptoms": ["腰痠", "遺精", "兩足痿弱", "眩暈耳鳴", "甚則耳聾", "口乾", "咽痛", "顴紅"]
      },
      {
        "name": "陽虛-心陽虛 ",
        "symptoms": ["心悸", "自汗", "神倦嗜臥", "心胸憋悶疼痛", "形寒肢冷", "面色蒼白"]
      },
      {
        "name": "陽虛-脾陽虛 ",
        "symptoms": ["面色萎黃", "食少", "形寒", "神倦乏力", "少氣懶言", "大便溏泄", "腸鳴腹痛", "每因受寒或飲食不慎而加劇"]
      },
      {
        "name": "陽虛-腎陽虛 ",
        "symptoms": ["腰背痠痛", "遺精陽萎", "多尿或不禁", "面色蒼白", "畏寒肢冷", "下利清谷或五更泄瀉"]
      }
    ]
  }
];

const tcmData = [

  { disease: "感冒", syndrome: "風寒", formula: "荊防敗毒散" },
  { disease: "感冒", syndrome: "風熱", formula: "銀翹散或蔥豉桔梗湯" },
  { disease: "感冒", syndrome: "暑濕", formula: "新加香薷飲" },
  { disease: "感冒", syndrome: "氣虛", formula: "參蘇飲" },
  { disease: "感冒", syndrome: "陰虛", formula: "加減葳蕤湯" },
  { disease: "咳嗽", syndrome: "風寒襲肺證", formula: "三拗湯, 止嗽散" },
  { disease: "咳嗽", syndrome: "風熱犯肺證", formula: "桑菊飲" },
  { disease: "咳嗽", syndrome: "風燥傷肺證 (溫燥)", formula: "桑杏湯" },
  { disease: "咳嗽", syndrome: "風燥傷肺證 (涼燥)", formula: "杏蘇散" },
  { disease: "咳嗽", syndrome: "痰濕蘊肺證", formula: "二陳湯,三子養親湯" },
  { disease: "咳嗽", syndrome: "痰熱鬱肺證", formula: "清金化痰湯" },
  { disease: "咳嗽", syndrome: "肝火犯肺證", formula: "黛蛤散,瀉白散" },
  { disease: "咳嗽", syndrome: "肺陰虧耗證", formula: "沙參麥冬湯" },
  { disease: "肺痿", syndrome: "虛熱證", formula: "麥門冬湯,清燥救肺湯" },
  { disease: "肺痿", syndrome: "虛寒證", formula: "甘草乾薑湯或生薑甘草湯" },
  { disease: "肺癰", syndrome: "初期 (表證期)", formula: "銀翹散" },
  { disease: "肺癰", syndrome: "成癰期", formula: "千金葦莖湯,如金解毒散" },
  { disease: "肺癰", syndrome: "潰膿期", formula: "加味桔梗湯" },
  { disease: "肺癰", syndrome: "恢復期", formula: "沙參清肺湯或桔梗杏仁煎" },
  { disease: "哮病", syndrome: "寒哮 (發作期)", formula: "射干麻黃湯, 小青龍湯" },
  { disease: "哮病", syndrome: "熱哮 (發作期)", formula: "定喘湯, 越婢加半夏湯" },
  { disease: "哮病", syndrome: "肺虛 (緩解期)", formula: "玉屏風散" },
  { disease: "哮病", syndrome: "脾虛 (緩解期)", formula: "六君子湯" },
  { disease: "哮病", syndrome: "肺腎兩虛證 (緩解期)", formula: "金匱腎氣丸或七味都氣丸" },
  { disease: "喘病", syndrome: "風寒壅肺 (實喘)", formula: "麻黃湯" },
  { disease: "喘病", syndrome: "表寒裡熱 (實喘)", formula: "麻杏石甘湯" },
  { disease: "喘病", syndrome: "痰熱鬱肺證 (實喘)", formula: "桑白皮湯" },
  { disease: "喘病", syndrome: "痰濁阻肺證 (實喘)", formula: "二陳湯,三子養親湯" },
  { disease: "喘病", syndrome: "肺氣鬱痹證 (實喘)", formula: "五磨飲子" },
  { disease: "喘病", syndrome: "肺氣虛耗證 (虛喘)", formula: "生脈散,補肺湯" },
  { disease: "喘病", syndrome: "腎虛不納證 (虛喘)", formula: "金匱腎氣丸,參蛤散" },
  
  { disease: "肺脹", syndrome: "痰濁壅肺證", formula: "蘇子降氣湯, 三子養親湯, 六君子湯" },
  { disease: "肺脹", syndrome: "痰熱鬱肺證", formula: "越婢加半夏湯或桑白皮湯" },
  { disease: "肺脹", syndrome: "痰蒙神竅證", formula: "滌痰湯, 安宮牛黃丸或至寶丹" },
  { disease: "肺脹", syndrome: "肺腎氣虛證", formula: "平喘固本湯, 補肺湯" },
  { disease: "肺脹", syndrome: "陽虛水泛證", formula: "真武湯,五苓散" },
  { disease: "肺癆", syndrome: "肺陰虧虛", formula: "月華丸" },
  { disease: "肺癆", syndrome: "陰虛火旺", formula: "百合固金湯,秦艽鱉甲散" },
  { disease: "肺癆", syndrome: "氣陰耗傷", formula: "保真湯" },
  { disease: "肺癆", syndrome: "陰陽兩虛", formula: "補天大造丸" },
  { disease: "痰飲", syndrome: "脾陽虛弱證", formula: "苓桂朮甘湯,小半夏加茯苓湯" },
  { disease: "痰飲", syndrome: "飲留胃腸", formula: "甘遂半夏湯或己椒苈黃丸" },
  { disease: "懸飲", syndrome: "邪犯胸肺證", formula: "柴枳半夏湯" },
  { disease: "懸飲", syndrome: "飲停胸脅證", formula: "十棗湯或控涎丹" },
  { disease: "懸飲", syndrome: "絡氣不和證", formula: "香附旋覆花湯" },
  { disease: "懸飲", syndrome: "陰虛內熱證", formula: "沙參麥冬湯, 瀉白散" },
  { disease: "溢飲", syndrome: "表寒裡飲證", formula: "小青龍湯" },
  { disease: "支飲", syndrome: "寒飲伏肺證", formula: "小青龍湯" },
  { disease: "支飲", syndrome: "脾腎陽虛證", formula: "金匱腎氣丸,苓桂朮甘湯" },
  { disease: "汗病", syndrome: "肺衛不固證", formula: "玉屏風散" },
  { disease: "汗病", syndrome: "營衛不和", formula: "桂枝湯加味" },
  { disease: "汗病", syndrome: "邪熱鬱蒸證", formula: "龍膽瀉肝湯" },
  { disease: "汗病", syndrome: "陰虛火旺證", formula: "當歸六黃湯" },
  { disease: "鼻衄", syndrome: "熱邪犯肺證", formula: "桑菊飲" },
  { disease: "鼻衄", syndrome: "胃熱熾盛證", formula: "玉女煎" },
  { disease: "鼻衄", syndrome: "肝火上炎證", formula: "龍膽瀉肝湯" },
  { disease: "鼻衄", syndrome: "氣血虧虛證", formula: "歸脾湯" },
  { disease: "齒衄", syndrome: "胃火熾盛證", formula: "加味清胃散,瀉心湯" },
  { disease: "齒衄", syndrome: "陰虛火旺證", formula: "滋水清肝飲,茜根散" },
  { disease: "咳血", syndrome: "燥熱傷肺證", formula: "桑杏湯" },
  { disease: "咳血", syndrome: "肝火犯肺證", formula: "瀉白散,黛蛤散" },
  { disease: "咳血", syndrome: "陰虛肺熱證", formula: "百合固金湯" },
  { disease: "吐血", syndrome: "胃熱壅盛證", formula: "瀉心湯,十灰散" },

  { disease: "吐血", syndrome: "肝火犯胃證", formula: "龍膽瀉肝湯" },
  { disease: "吐血", syndrome: "氣虛血溢證", formula: "歸脾湯" },
  { disease: "便血", syndrome: "腸道濕熱證", formula: "地榆散,槐角丸" },
  { disease: "便血", syndrome: "脾胃虛寒證", formula: "黃土湯" },
  { disease: "尿血", syndrome: "下焦濕熱證", formula: "小薊飲子" },
  { disease: "尿血", syndrome: "腎虛火旺證", formula: "知柏地黃丸" },
  { disease: "尿血", syndrome: "脾不統血證", formula: "歸脾湯" },
  { disease: "尿血", syndrome: "腎氣不固證", formula: "無比山藥丸" },
  { disease: "紫斑", syndrome: "血熱妄行證", formula: "犀角地黃湯,十灰散" },
  { disease: "紫斑", syndrome: "氣不攝血證", formula: "歸脾湯" },
  { disease: "紫斑", syndrome: "陰虛火旺證", formula: "茜根散" },
  { disease: "心悸", syndrome: "心虛膽怯證", formula: "安神定志丸" },
  { disease: "心悸", syndrome: "心血不足證", formula: "歸脾湯" },
  { disease: "心悸", syndrome: "陰虛火旺證", formula: "天王補心丹, 朱砂安神丸" },
  { disease: "心悸", syndrome: "心陽不振證", formula: "桂枝甘草龍骨牡蠣湯" },
  { disease: "心悸", syndrome: "水飲凌心證", formula: "苓桂朮甘湯" },
  { disease: "心悸", syndrome: "瘀阻心脈證", formula: "桃仁紅花煎" },
  { disease: "胸痹", syndrome: "心血瘀阻證", formula: "血府逐瘀湯" },
  { disease: "胸痹", syndrome: "痰濁閉阻證", formula: "栝蔞薤白半夏湯" },
  { disease: "胸痹", syndrome: "陰寒凝滯證", formula: "枳實薤白白酒湯" },
  { disease: "胸痹", syndrome: "氣陰兩虛證", formula: "生脈散,人參養榮湯" },
  { disease: "胸痹", syndrome: "心腎陰虛證", formula: "左歸飲" },
  { disease: "胸痹", syndrome: "陽氣虛衰證", formula: "右歸飲,參附湯" },
  { disease: "不寐", syndrome: "痰熱擾心證", formula: "溫膽湯" },
  { disease: "不寐", syndrome: "肝火擾心證", formula: "龍膽瀉肝湯" },
  { disease: "不寐", syndrome: "心膽氣虛證", formula: "安神定志丸,酸棗仁湯" },
  { disease: "不寐", syndrome: "心脾兩虛證", formula: "歸脾湯" },
  { disease: "不寐", syndrome: "陰虛火旺 (心腎不交)", formula: "黃連阿膠湯, 朱砂安神丸" },
  { disease: "厥證", syndrome: "氣厥 (實證)", formula: "五磨飲子" },
  { disease: "厥證", syndrome: "氣厥 (虛證)", formula: "四味回陽飲" },
  { disease: "厥證", syndrome: "血厥 (實證)", formula: "通瘀煎" },
  { disease: "厥證", syndrome: "血厥 (虛證)", formula: "獨參湯, 人參養榮湯" },
  { disease: "厥證", syndrome: "痰厥", formula: "導痰湯" },
  { disease: "厥證", syndrome: "食厥", formula: "鹽湯探吐, 神術散, 保和丸" },

  { disease: "鬱證", syndrome: "肝氣鬱結證", formula: "柴胡疏肝散" },
  { disease: "鬱證", syndrome: "氣鬱化火證", formula: "丹梔逍遙散" },
  { disease: "鬱證", syndrome: "氣滯痰鬱證", formula: "半夏厚朴湯" },
  { disease: "鬱證", syndrome: "憂鬱傷神證", formula: "甘麥大棗湯" },
  { disease: "鬱證", syndrome: "心脾兩虛證", formula: "歸脾湯" },
  { disease: "鬱證", syndrome: "陰虛火旺證", formula: "滋水清肝飲" },
  { disease: "癲狂", syndrome: "痰氣鬱結", formula: "順氣導痰湯" },
  { disease: "癲狂", syndrome: "心脾兩虛", formula: "養心湯" },
  { disease: "癲狂", syndrome: "痰火上擾", formula: "生鐵落飲" },
  { disease: "癲狂", syndrome: "火盛傷陰", formula: "二陰煎" },
  { disease: "癇病", syndrome: "風痰閉阻證", formula: "定癇丸" },
  { disease: "癇病", syndrome: "痰火內盛證", formula: "龍膽瀉肝湯,滌痰湯" },
  { disease: "癇病", syndrome: "心腎虧虛證", formula: "大補元煎" },
  { disease: "胃痛", syndrome: "寒邪客胃證", formula: "良附丸" },
  { disease: "胃痛", syndrome: "飲食停滯證", formula: "保和丸" },
  { disease: "胃痛", syndrome: "肝氣犯胃證", formula: "柴胡疏肝散" },
  { disease: "胃痛", syndrome: "肝胃鬱熱證", formula: "化肝煎" },
  { disease: "胃痛", syndrome: "瘀血停滯證", formula: "失笑散,丹參飲" },
  { disease: "胃痛", syndrome: "胃陰虧虛證", formula: "一貫煎,芍藥甘草湯" },
  { disease: "胃痛", syndrome: "脾胃虛寒證", formula: "黃芪建中湯" },
  { disease: "噎嗝", syndrome: "痰氣交阻證", formula: "啟膈散" },
  { disease: "噎嗝", syndrome: "津虧熱結證", formula: "五汁安中湯" },
  { disease: "噎嗝", syndrome: "瘀血內結證", formula: "通幽湯" },
  { disease: "噎嗝", syndrome: "氣虛陽微證", formula: "補氣運脾湯, 右歸丸" },
  { disease: "嘔吐", syndrome: "外邪犯胃證", formula: "藿香正氣散" },
  { disease: "嘔吐", syndrome: "食滯內停證", formula: "保和丸" },
  { disease: "嘔吐", syndrome: "肝氣犯胃證", formula: "半夏厚朴湯, 左金丸" },
  { disease: "嘔吐", syndrome: "痰飲內阻證", formula: "小半夏湯,苓桂朮甘湯" },
  { disease: "嘔吐", syndrome: "胃陰不足證", formula: "麥門冬湯" },
  { disease: "嘔吐", syndrome: "脾胃虛寒證", formula: "理中湯" },
  { disease: "呃逆", syndrome: "胃中寒冷證", formula: "丁香散" },
  { disease: "呃逆", syndrome: "胃火上逆證", formula: "竹葉石膏湯" },
  { disease: "呃逆", syndrome: "氣機鬱滯證", formula: "五磨飲子" },
  { disease: "呃逆", syndrome: "胃陰不足證", formula: "益胃湯, 橘皮竹茹湯" },
  { disease: "呃逆", syndrome: "脾胃陽虛證", formula: "理中丸" },

  { disease: "泄瀉", syndrome: "寒濕證", formula: "藿香正氣散" },
  { disease: "泄瀉", syndrome: "濕熱證", formula: "葛根芩連湯" },
  { disease: "泄瀉", syndrome: "食滯腸胃證", formula: "保和丸" },
  { disease: "泄瀉", syndrome: "肝氣乘脾證", formula: "痛瀉要方" },
  { disease: "泄瀉", syndrome: "腎陽虛衰證", formula: "四神丸" },
  { disease: "泄瀉", syndrome: "脾胃虛弱證", formula: "參苓白朮散" },
  { disease: "痢疾", syndrome: "濕熱痢", formula: "芍藥湯" },
  { disease: "痢疾", syndrome: "疫毒痢", formula: "白頭翁湯" },
  { disease: "痢疾", syndrome: "寒濕痢", formula: "不換金正氣散" },
  { disease: "痢疾", syndrome: "陰虛痢", formula: "駐車丸" },
  { disease: "痢疾", syndrome: "虛寒痢", formula: "桃花湯, 真人養臟湯" },
  { disease: "痢疾", syndrome: "休息痢", formula: "連理湯" },
  { disease: "霍亂", syndrome: "寒霍亂 (輕證)", formula: "藿香正氣散,純陽正氣丸" },
  { disease: "霍亂", syndrome: "寒霍亂 (重證)", formula: "附子理中湯" },
  { disease: "霍亂", syndrome: "熱霍亂", formula: "蠶矢湯或燃照湯" },
  { disease: "霍亂", syndrome: "乾霍亂", formula: "玉樞丹" },
  { disease: "腹痛", syndrome: "寒邪內阻證", formula: "良附丸,正氣天香散" },
  { disease: "腹痛", syndrome: "濕熱壅滯證", formula: "大承氣湯" },
  { disease: "腹痛", syndrome: "飲食積滯證", formula: "保濟丸, 枳實導滯丸" },
  { disease: "腹痛", syndrome: "氣滯血瘀證", formula: "柴胡疏肝散, 少腹逐瘀湯" },
  { disease: "腹痛", syndrome: "中虛臟寒證", formula: "小建中湯" },
  { disease: "便祕", syndrome: "熱秘", formula: "麻子仁丸" },
  { disease: "便祕", syndrome: "氣秘", formula: "六磨湯" },
  { disease: "便祕", syndrome: "氣虛秘", formula: "黃芪湯" },
  { disease: "便祕", syndrome: "血虛秘", formula: "潤腸丸" },
  { disease: "便祕", syndrome: "冷秘", formula: "濟川煎" },
  { disease: "蟲證", syndrome: "蛔蟲證", formula: "烏梅丸, 化蟲丸" },
  { disease: "蟲證", syndrome: "絛蟲證", formula: "南瓜子、檳榔,方" },
  { disease: "蟲證", syndrome: "鉤蟲證 (脾虛濕滯)", formula: "黃病絳礬丸" },
  { disease: "蟲證", syndrome: "鉤蟲證 (氣血兩虛)", formula: "八珍湯" },
  { disease: "蟲證", syndrome: "蟯蟲證", formula: "追蟲丸" },
  { disease: "蟲證", syndrome: "薑片蟲證", formula: "檳榔煎劑" },
  { disease: "脅痛", syndrome: "肝氣鬱結證", formula: "柴胡疏肝散" },
  { disease: "脅痛", syndrome: "瘀血停著證", formula: "旋覆花湯" },
  { disease: "脅痛", syndrome: "肝膽濕熱證", formula: "龍膽瀉肝湯" },
  { disease: "脅痛", syndrome: "肝陰不足證", formula: "一貫煎" },

  { disease: "黃疸", syndrome: "陽黃 (熱重於濕)", formula: "茵陳蒿湯" },
  { disease: "黃疸", syndrome: "陽黃 (濕重於熱)", formula: "茵陳五苓散,甘露消毒丹" },
  { disease: "黃疸", syndrome: "疫毒熾盛證 (急黃)", formula: "犀角散加味" },
  { disease: "黃疸", syndrome: "陰黃 (寒濕阻遏)", formula: "茵陳術附湯" },
  { disease: "黃疸", syndrome: "肝脾不調 (消退後)", formula: "逍遙散或香砂六君子湯" },
  { disease: "積聚", syndrome: "肝氣鬱結(聚證)", formula: "逍遙散" },
  { disease: "積聚", syndrome: "食滯痰阻(聚證)", formula: "六磨湯" },
  { disease: "積聚", syndrome: "氣滯血阻(積證)", formula: "金鈴子散,失笑散" },
  { disease: "積聚", syndrome: "瘀血內結(積證)", formula: "膈下逐瘀湯, 蟞甲煎丸,六君子" },
  { disease: "積聚", syndrome: "正虛瘀結(積證)", formula: "化積丸, 八珍湯" },
  { disease: "鼓脹", syndrome: "氣滯濕阻證", formula: "柴胡疏肝散,胃苓湯" },
  { disease: "鼓脹", syndrome: "寒濕困脾證", formula: "實脾飲" },
  { disease: "鼓脹", syndrome: "濕熱蘊結證", formula: "中滿分消丸,茵陳蒿湯, 舟車丸" },
  { disease: "鼓脹", syndrome: "肝脾血瘀證", formula: "調營飲" },
  { disease: "鼓脹", syndrome: "脾腎陽虛證", formula: "附子理中丸,五苓散, 濟生腎氣丸" },
  { disease: "鼓脹", syndrome: "肝腎陰虛證", formula: "六味地黃丸,一貫煎" },
  { disease: "頭痛", syndrome: "風寒證 (外感)", formula: "川芎茶調散" },
  { disease: "頭痛", syndrome: "風熱證 (外感)", formula: "芎芷石膏湯" },
  { disease: "頭痛", syndrome: "風濕證 (外感)", formula: "羌活勝濕湯" },
  { disease: "頭痛", syndrome: "肝陽證 (內傷)", formula: "天麻鉤藤飲" },
  { disease: "頭痛", syndrome: "腎虛證 (內傷)", formula: "大補元煎" },
  { disease: "頭痛", syndrome: "血虛證 (內傷)", formula: "加味四物湯" },
  { disease: "頭痛", syndrome: "痰濁證 (內傷)", formula: "半夏白朮天麻湯" },
  { disease: "頭痛", syndrome: "瘀血證 (內傷)", formula: "通竅活血湯" },
  { disease: "眩暈", syndrome: "肝陽上亢證", formula: "天麻鉤藤飲" },
  { disease: "眩暈", syndrome: "氣血虧虛證", formula: "歸脾湯" },
  { disease: "眩暈", syndrome: "腎精不足證", formula: "左歸丸" },
  { disease: "眩暈", syndrome: "痰濕中阻證", formula: "半夏白朮天麻湯" },
  { disease: "眩暈", syndrome: "瘀血阻竅證", formula: "通竅活血湯" },
  { disease: "中風", syndrome: "中經絡 (脈絡空虛)", formula: "大秦艽丸" },
  { disease: "中風", syndrome: "中經絡 (肝腎陰虛)", formula: "鎮肝熄風湯" },
  { disease: "中風", syndrome: "中臟腑 (陽閉)", formula: "羚角鉤藤湯, 至寶丹, 安宮牛黃丸" },
  { disease: "中風", syndrome: "中臟腑 (陰閉)", formula: "滌痰湯, 蘇合香丸" },
  { disease: "中風", syndrome: "中臟腑 (脫證)", formula: "參附湯,生脈散加味" },
  { disease: "中風", syndrome: "半身不遂", formula: "補陽還五湯" },
  { disease: "中風", syndrome: "語言不利 , 口眼窩斜", formula: "解語丹" },

  { disease: "中風", syndrome: "肝腎虧虛", formula: "地黃飲子" },
  { disease: "中風", syndrome: "肝陽上亢", formula: "鎮肝熄風湯, 天麻鉤藤飲" },
  { disease: "痙病", syndrome: "邪壅經絡", formula: "羌活勝濕湯" },
  { disease: "痙病", syndrome: "熱甚發痙", formula: "增液承氣湯" },
  { disease: "痙病", syndrome: "陰血虧虛", formula: "四物湯,大定風珠" },
  { disease: "癭病", syndrome: "氣鬱痰阻證", formula: "四海舒鬱丸" },
  { disease: "癭病", syndrome: "痰結血瘀證", formula: "海藻玉壺湯" },
  { disease: "癭病", syndrome: "肝火旺盛證", formula: "梔子清肝湯,藻藥散" },
  { disease: "癭病", syndrome: "心肝陰虛證", formula: "天王補心丹" },
  { disease: "瘧疾", syndrome: "正瘧", formula: "柴胡截瘧飲" },
  { disease: "瘧疾", syndrome: "溫瘧", formula: "白虎加桂枝湯" },
  { disease: "瘧疾", syndrome: "寒瘧", formula: "柴胡桂枝乾薑湯,截瘧七寶飲" },
  { disease: "瘧疾", syndrome: "熱瘴 (瘴瘧)", formula: "清瘴湯" },
  { disease: "瘧疾", syndrome: "冷瘴 (瘴瘧)", formula: "加味不換金正氣散" },
  { disease: "瘧疾", syndrome: "勞瘧", formula: "何人飲" },
  { disease: "水腫", syndrome: "風水氾濫 (陽水)", formula: "越婢加朮湯" },
  { disease: "水腫", syndrome: "濕毒浸淫 (陽水)", formula: "麻黃連翹赤小豆湯,五味消毒飲" },
  { disease: "水腫", syndrome: "水濕浸漬 (陽水)", formula: "五皮飲,胃苓湯" },
  { disease: "水腫", syndrome: "濕熱壅盛 (陽水)", formula: "疏鑿飲子" },
  { disease: "水腫", syndrome: "脾陽虛衰 (陰水)", formula: "實脾飲" },
  { disease: "水腫", syndrome: "腎陽衰微 (陰水)", formula: "濟生腎氣丸,真武湯" },
  { disease: "淋證", syndrome: "熱淋", formula: "八正散" },
  { disease: "淋證", syndrome: "石淋", formula: "石韋散" },
  { disease: "淋證", syndrome: "氣淋 (實,虛)", formula: "沉香散 , 補中益氣湯, 八珍湯" },
  { disease: "淋證", syndrome: "血淋 (實,虛)", formula: "小薊飲子 , 知柏地黃丸" },
  { disease: "淋證", syndrome: "膏淋 (實,虛)", formula: "程氏萆薢分清飲 , 補中益氣湯,七味都氣丸" },
  { disease: "淋證", syndrome: "勞淋", formula: "無比山藥丸" },
  { disease: "癃閉", syndrome: "膀胱濕熱證", formula: "八正散" },
  { disease: "癃閉", syndrome: "肺熱壅盛證", formula: "清肺飲" },
  { disease: "癃閉", syndrome: "肝鬱氣滯證", formula: "沉香散" },
  { disease: "癃閉", syndrome: "尿路阻塞證", formula: "代抵當丸" },
  { disease: "癃閉", syndrome: "中氣不足證", formula: "補中益氣湯,春澤湯" },
  { disease: "癃閉", syndrome: "腎陽衰憊證", formula: "濟生腎氣丸" },
  { disease: "腰痛", syndrome: "寒濕腰痛", formula: "甘薑苓朮湯" },

  { disease: "腰痛", syndrome: "濕熱腰痛", formula: "四妙丸" },
  { disease: "腰痛", syndrome: "瘀血腰痛", formula: "身痛逐瘀湯" },
  { disease: "腰痛", syndrome: "腎陰虛 (腎虛)", formula: "左歸丸" },
  { disease: "腰痛", syndrome: "腎陽虛 (腎虛)", formula: "右歸丸" },
  { disease: "消渴", syndrome: "肺熱津傷 (上消)", formula: "消渴方, 二冬湯" },
  { disease: "消渴", syndrome: "胃熱熾盛 (中消)", formula: "玉女煎" },
  { disease: "消渴", syndrome: "腎陰虧虛 (下消)", formula: "六味地黃丸" },
  { disease: "消渴", syndrome: "陰陽兩虛 (下消)", formula: "金匱腎氣丸" },
  { disease: "遺精", syndrome: "君相火旺", formula: "黃連清心飲, 天王補心丹, 三才封髓丹" },
  { disease: "遺精", syndrome: "濕熱下注", formula: "程氏萆薢分清飲" },
  { disease: "遺精", syndrome: "勞傷心脾", formula: "妙香散" },
  { disease: "遺精", syndrome: "腎虛滑脫", formula: "六味地黃丸, 左歸飲, 金鎖固精丸" },
    { disease: "陽痿", syndrome: "命火衰微", formula: "五子衍宗丸, 贊育丹" },
  { disease: "陽痿", syndrome: "心脾受損", formula: "歸脾湯" },
  { disease: "陽痿", syndrome: "恐懼傷腎", formula: "大補元煎" },
  { disease: "陽痿", syndrome: "濕熱下注", formula: "知柏地黃丸" },
  { disease: "耳鳴耳聾", syndrome: "肝膽火盛", formula: "龍膽瀉肝湯" },
  { disease: "耳鳴耳聾", syndrome: "痰火鬱結", formula: "溫膽湯" },
  { disease: "耳鳴耳聾", syndrome: "風熱上擾", formula: "銀翹散" },
  { disease: "耳鳴耳聾", syndrome: "腎精虧虛", formula: "耳聾左慈丸" },
  { disease: "耳鳴耳聾", syndrome: "清氣不升", formula: "益氣聰明湯" },
  { disease: "痹證", syndrome: "行痹 (風偏勝)", formula: "防風湯" },
  { disease: "痹證", syndrome: "痛痹 (寒偏勝)", formula: "烏頭湯" },
  { disease: "痹證", syndrome: "著痹 (濕偏勝)", formula: "薏苡仁湯" },
  { disease: "痹證", syndrome: "風濕熱痹", formula: "白虎加桂枝湯或宣痹湯" },
  { disease: "痹證", syndrome: "肝腎兩虛證", formula: "獨活寄生湯" },
  { disease: "痿證", syndrome: "肺熱津傷證", formula: "清燥救肺湯" },
  { disease: "痿證", syndrome: "濕熱浸淫證", formula: "加味二妙散" },
  { disease: "痿證", syndrome: "脾胃虛弱證", formula: "參苓白朮散, 補中益氣湯" },
  { disease: "痿證", syndrome: "肝腎虧損證", formula: "虎潛丸" },
  { disease: "內傷發熱", syndrome: "肝鬱發熱證", formula: "丹梔逍遙散" },
  { disease: "內傷發熱", syndrome: "氣虛發熱證", formula: "補中益氣湯" },
  { disease: "內傷發熱", syndrome: "血瘀發熱證", formula: "血府逐瘀湯" },
  { disease: "內傷發熱", syndrome: "血虛發熱證", formula: "歸脾湯" },
  { disease: "內傷發熱", syndrome: "陰虛發熱證", formula: "清骨散" },
  { disease: "虛勞", syndrome: "肺氣虛", formula: "補肺湯" },
  { disease: "虛勞", syndrome: "脾氣虛", formula: "加味四君子湯" },

  { disease: "虛勞", syndrome: "心血虛", formula: "養心湯" },
  { disease: "虛勞", syndrome: "肝血虛", formula: "四物湯" },
  { disease: "虛勞", syndrome: "肝陰虛", formula: "補肝湯" },
  { disease: "虛勞", syndrome: "心陰虛", formula: "天王補心丹" },
  { disease: "虛勞", syndrome: "脾胃陰虛", formula: "益胃湯" },
  { disease: "虛勞", syndrome: "肺陰虛", formula: "沙參麥冬湯" },
  { disease: "虛勞", syndrome: "腎陰虛", formula: "左歸丸" },
  { disease: "虛勞", syndrome: "心陽虛", formula: "拯陽理勞湯" },
  { disease: "虛勞", syndrome: "脾陽虛", formula: "附子理中湯" },
  { disease: "虛勞", syndrome: "腎陽虛", formula: "右歸丸" }
];
const iSpell=[
{name:"感冒",spell : "荆银加蘇減"},
{name:"咳嗽",spell : "三山桑桑杏杏二三清化白蛤麥"},
{name:"肺痿",spell : "麥清加甘薑"},
{name:"肺癰",spell : "银翘千金如金加梗沙清杏仁"},
{name:"哮病",spell : "射干小清定越玉子金氣"},
{name:"喘病",spell : "麻麻桑二三五子肺脈金蛤"},
{name:"肺脹",spell : "蘇三六婢白滌牛寶固補真苓"},
{name:"肺癆",spell : "月金甲真大"},
{name:"痰飲",spell : "苓夏甘椒,柴积棗涎花香沙白,小小青龍金匱苓"},
{name:"懸飲",spell : "苓夏甘椒,柴积棗涎花香沙白,小小青龍金匱苓"},
{name:"溢飲",spell : "苓夏甘椒,柴积棗涎花香沙白,小小青龍金匱苓"},
{name:"支飲",spell : "苓夏甘椒,柴积棗涎花香沙白,小小青龍金匱苓"},
{name:"汗病",spell : "屏枝當龍"},
{name:"鼻衄",spell : "桑女龍歸,清心滋西,杏白蛤固,心灰龍歸、榆槐黄土,小薊知脾無比,犀茜歸"},
{name:"齒衄",spell : "桑女龍歸,清心滋西,杏白蛤固,心灰龍歸、榆槐黄土,小薊知脾無比,犀茜歸"},
{name:"咳血",spell : "桑女龍歸,清心滋西,杏白蛤固,心灰龍歸、榆槐黄土,小薊知脾無比,犀茜歸"},
{name:"吐血",spell : "桑女龍歸,清心滋西,杏白蛤固,心灰龍歸、榆槐黄土,小薊知脾無比,犀茜歸"},
{name:"便血",spell : "桑女龍歸,清心滋西,杏白蛤固,心灰龍歸、榆槐黄土,小薊知脾無比,犀茜歸"},
{name:"尿血",spell : "桑女龍歸,清心滋西,杏白蛤固,心灰龍歸、榆槐黄土,小薊知脾無比,犀茜歸"},
{name:"紫斑",spell : "桑女龍歸,清心滋西,杏白蛤固,心灰龍歸、榆槐黄土,小薊知脾無比,犀茜歸"},
{name:"心悸",spell : "安神收皮補朱龍牡苓桃"},
{name:"不寐",spell : "安枣收皮膠朱龍肝温瞻"},
{name:"胸痹",spell : "血夏白酒生养左右附"},
{name:"厥證",spell : "五四通獨養榮導痰鹽術保"},
{name:"鬱證",spell : "胡逍半厚甘棗歸滋水"},
{name:"癲狂",spell : "順氣養心落二陰"},
{name:"癇病",spell : "定癇滌龍大補元"},
{name:"胃痛",spell : "良和胡化失丹貫芍黄中"},
{name:"腹痛",spell: "良香濟枳胡少大承建中"},
{name:"嘔吐",spell : "正氣保和金樸半桂麥門理"},
{name:"泄瀉",spell : "正氣保和芩蓮痛泻白术神"},
{name:"噎嗝",spell : "啟汁幽運歸"},
{name:"呃逆",spell : "香竹五益皮理"},
{name:"便祕",spell : "麻子六磨黄潤川"},
{name:"痢疾",spell : "芍薬白頭不換車,桃花真人連理噤"},
{name:"霍亂",spell : "正氣纯陽附子蠶燃枢"},
{name:"蟲證",spell : "烏梅化蟲南瓜絳,八珍追蟲檳榔煎"},
{name:"脅痛",spell:  "柴旋龍一"},
{name:"黃疸",spell: "茵茵甘露犀附逍遥六"},
{name:"積聚",spell: "逍遥六磨,金铃失笑,隔鱉六君,化積八珍"},
{name:"鼓脹",spell: "柴苓實脾消陳車,调营附子五濟,六地貫"},
{name:"頭痛",spell: "茶调石膏勝濕,天夏通竅大四物"},
{name:"眩暈",spell: "天夏通竅左收皮"},
{name:"中風",spell: "大秦镇熄牛羊寶,滌痰蘇合附生脈,補陽解語地黄飲,镇肝息風天钩藤"},
{name:"痙病",spell: "勝濕增液四大珠"},
{name:"癭病",spell: "四玉栀藥天王"},
{name:"瘧疾",spell: "柴虎柴寶清瘴換人"},
{name:"水腫",spell : "越婢小豆消,五苓鑿實濟真武"},
{name:"淋證",spell : "八石沉八补,小柏呈七补,→無比山"},
{name:"癃閉",spell : "八清沉當中春濟"},
{name:"腰痛",spell : "甘苓四妙身痛左右歸"},
{name:"消渴",spell : "消渴二冬,玉女六金"},
{name:"遺精",spell : "黄天三才、程氏妙香、六味歸固精"},
{name:"陽痿",spell : "五子贊育歸元地"},
{name:"耳鳴耳聾",spell : "银翘肝膽左慈明"},
{name:"痹證",spell : "風頭仁白虎宣獨"},
{name:"痿證",spell : "清燥二妙參中潛"},
{name:"內傷發熱",spell : "丹氣瘀脾清骨散"},
{name:"虛勞",spell : "補肺四君養四物,肝心益胃沙左歸,拯陽附子理右歸"},

];


const formula = [
  { name: "一貫煎", ingredients: "沙參、麥冬、當歸、生地黃、枸杞子、川楝子" },
  { name: "二冬湯", ingredients: "天冬、麥冬、天花粉、黃芩、知母、甘草、人參、荷葉" },
  { name: "二仙湯", ingredients: "仙茅、仙靈脾、巴戟天、黃柏、知母、當歸" },
  { name: "二至丸", ingredients: "女貞子、旱蓮草" },
  { name: "二陳湯", ingredients: "半夏、橘皮、茯苓、炙甘草" },
  { name: "二陰煎", ingredients: "生地黃、麥冬、棗仁、生甘草、玄參、茯苓、黃連、木通、燈心、竹葉" },
  { name: "二妙丸", ingredients: "黃柏、蒼術" },
  { name: "二神散", ingredients: "海金砂、滑石" },
  { name: "十全大補湯", ingredients: "熟地黃、白芍、當歸、川芎、人參、白術、茯苓、炙甘草、黃芪、肉桂" },
  { name: "十灰散", ingredients: "大薊、小薊、側柏葉、荷葉、茜草根、山梔、茅根、大黃、丹皮、棕櫚皮" },
  { name: "十棗湯", ingredients: "大戟、芫花、甘遂、大棗" },
  { name: "丁沉透解散", ingredients: "白木、香附、人參、砂仁、丁香、麥芽、木香、肉豆蔻、神曲、炙甘草、沉香、青皮、厚朴、藿香、陳皮、半夏、草果" },
  { name: "丁香散", ingredients: "丁香、柿蒂、良薑、炙甘草" },
  { name: "七味都氣丸", ingredients: "地黃、山茱萸、山藥、茯苓、丹皮、澤瀉、五味子" },
  { name: "人參養營湯", ingredients: "人參、甘草、當歸、白芍、熟地黃、肉桂、大棗、黃芪、白術、茯苓、五味子、遠志、橘皮、生薑" },
  { name: "八正散", ingredients: "木通、車前子、萹蓄、瞿麥、滑石、甘草、梔子、大黃、燈芯" },
  { name: "八珍湯", ingredients: "人參、白術、茯苓、甘草、當歸、白芍藥、川芎、熟地黃、生薑、大棗" },
  { name: "三才封髓丹", ingredients: "天冬、熟地黃、人參、黃柏、砂仁、甘草" },
  { name: "三子養親湯", ingredients: "蘇子、白芥子、萊菔子" },
  { name: "三仁湯", ingredients: "杏仁、白蔻仁、薏苡仁、厚朴、半夏、通草、滑石、竹葉" },
  { name: "三聖散", ingredients: "瓜蒂、防風、藜蘆" },
  { name: "三拗湯", ingredients: "麻黃、杏仁、甘草" },
  { name: "大七氣湯", ingredients: "青皮、陳皮、桔梗、藿香、官桂、甘草、三棱、莪術、木香、附子、益智仁、生薑" },
  { name: "大半夏湯", ingredients: "半夏、白蜜、人參" },
  { name: "大補元煎", ingredients: "人參、杜仲、枸杞子、當歸、山茱萸、炒山藥、熟地黃、炙甘草" },
  { name: "大補陰丸", ingredients: "知母、黃柏、熟地黃、龜版、豬脊髓" },
  { name: "大青龍湯", ingredients: "麻黃、杏仁、桂枝、甘草、石膏、生薑、大棗" },
  { name: "大定風珠", ingredients: "白芍藥、阿膠、生龜版、生地黃、火麻仁、五味子、生牡蠣、麥冬、炙甘草、雞子黃、生鱉甲" },
  { name: "大建中湯", ingredients: "川椒、干薑、人參、飴糖" },
  { name: "大承氣湯", ingredients: "大黃、厚朴、枳實、芒硝" },
  { name: "大秦艽湯", ingredients: "秦艽、當歸、甘草、羌活、防風、白芷、熟地黃、茯苓、石膏、川芎、白芍藥、獨活、黃芩、生地、白術、細辛" },
  { name: "大柴胡湯", ingredients: "柴胡、黃芩、半夏、枳實、白芍藥、大黃、生薑、大棗" },
  { name: "大黃甘草湯", ingredients: "大黃、甘草" },
  { name: "大黃附子湯", ingredients: "大黃、附子、細辛" },
  { name: "大黃硝石湯", ingredients: "大黃、黃柏、硝石、梔子" },
  { name: "大黃蟅蟲丸", ingredients: "地鱉蟲、干漆、干地黃、甘草、水蛭、白芍、杏仁、黃芩、桃仁、虻蟲、蠐螬、大黃" },
  { name: "川芎茶調散", ingredients: "川芎、荊芥、薄荷、羌活、細辛(或香附)、白芷、甘草、防風" },
  { name: "千金葦莖湯", ingredients: "鮮蘆根、薏苡仁、冬瓜仁、桃仁" },
  { name: "已椒藶黃丸", ingredients: "防已、椒目、葶藶子、大黃" },
  { name: "小半夏加茯苓湯", ingredients: "半夏、生薑、茯苓" },
  { name: "小半夏湯", ingredients: "半夏、生薑" },
  { name: "小青龍加石膏湯", ingredients: "麻黃、桂枝、芍藥、甘草、干薑、細辛、半夏、五味子、石膏" },
  { name: "小青龍湯", ingredients: "麻黃、桂枝、芍藥、甘草、干薑、細辛、半夏、五味子" },
  { name: "小建中湯", ingredients: "桂枝、白芍、甘草、生薑、大棗、飴糖" },
  { name: "小承氣湯", ingredients: "大黃、厚朴、枳實" },
  { name: "小柴胡湯", ingredients: "柴胡、黃芩、半夏、人參、甘草、生薑、大棗" },
  { name: "小陷胸湯", ingredients: "黃連、半夏、栝樓" },
  { name: "小薊飲子", ingredients: "生地黃、小薊、滑石、通草、炒蒲黃、淡竹葉、藕節、當歸、山梔、甘草" },
  { name: "天王補心丹", ingredients: "人參、玄參、丹參、茯苓、五味子、遠志、桔梗、當歸身、天冬、麥冬、柏子仁、酸棗仁、生地黃、辰砂" },
  { name: "天麻鉤藤飲", ingredients: "天麻、鉤藤、生石決明、川牛膝、桑寄生、杜仲、山梔、黃芩、益母草、朱茯神、夜交藤" },
  { name: "無比山藥丸", ingredients: "山藥、肉苁蓉、熟地黃、山茱萸、茯神、菟絲子、五味子、赤石脂、巴戟天、澤瀉、杜仲、牛膝" },
  { name: "開噤散", ingredients: "人參、黃連、石菖蒲、丹參、石蓮子、茯苓、陳皮、冬瓜子、陳米、荷葉" },
  { name: "木防已湯", ingredients: "木防已、石膏、桂枝、人參" },
  { name: "木香順氣散", ingredients: "木香、青皮、橘皮、甘草、枳殼、川朴、烏藥、香附、蒼術、砂仁、桂心、川芎" },
  { name: "木香檳榔丸", ingredients: "木香、香附、青皮、陳皮、枳殼、黑丑、檳榔、黃連、黃柏、三棱、莪術、大黃、芒硝" },
  { name: "止嗽散", ingredients: "荊芥、桔梗、甘草、白前、陳皮、百部、紫菀" },
  { name: "中滿分消丸", ingredients: "厚朴、枳實、黃連、黃芩、知母、半夏、陳皮、茯苓、豬苓、澤瀉、砂仁、干薑、姜黃、人參、白術、炙甘草" },
  { name: "五子衍宗丸", ingredients: "枸杞子、覆盆子、菟絲子、五味子、車前子" },
  { name: "五仁丸", ingredients: "桃仁、杏仁、柏子仁、松子仁、郁李仁、橘皮" },
  { name: "五汁安中飲", ingredients: "韭汁、牛乳、生薑汁、梨汁、藕汁" },
  { name: "五皮散", ingredients: "桑白皮、橘皮、生薑皮、大腹皮、茯苓皮" },
  { name: "五苓散", ingredients: "桂枝、白術、茯苓、豬苓、澤瀉" },
  { name: "五味消毒飲", ingredients: "金銀花、野菊花、蒲公英、紫花地丁、紫背天葵" },
  { name: "五積散", ingredients: "白芷、橘皮、厚朴、當歸、川芎、白芍藥、茯苓、桔梗、蒼術、枳殼、半夏、麻黃、干肉桂、甘草" },
  { name: "五磨飲子", ingredients: "烏藥、沉香、檳榔、枳實、木香" },
  { name: "六一散", ingredients: "滑石、甘草" },
  { name: "六君子湯", ingredients: "人參、炙甘草、茯苓、白術、陳皮、制半夏" },
  { name: "六味地黃丸", ingredients: "熟地黃、山藥、茯苓、丹皮、澤瀉、山茱萸" },
  { name: "六磨湯", ingredients: "沉香、木香、檳榔、烏藥、枳實、大黃" },
  { name: "化蟲丸", ingredients: "檳榔、鶴虱、苦楝根皮、炒胡粉、使君子、蕪荑" },
  { name: "化肝煎", ingredients: "青皮、陳皮、芍藥、丹皮、梔子、澤瀉、貝母" },
  { name: "化積丸", ingredients: "三棱、莪術、阿魏、海浮石、香附、雄黃、檳榔、蘇木、瓦楞子、五靈脂" },
  { name: "月華丸", ingredients: "天冬、麥冬、生地黃、熟地黃、山藥、百部、沙參、川貝母、茯苓、阿膠、三七、燕窩、白菊花、桑葉" },
  { name: "丹參飲", ingredients: "丹參、檀香、砂仁" },
  { name: "丹梔逍遙散", ingredients: "當歸、白芍藥、白術、柴胡、茯苓、甘草、煨薄荷、丹皮、山梔" },
  { name: "烏頭湯", ingredients: "川烏、麻黃、芍藥、黃芪、甘草" },
  { name: "烏梅丸", ingredients: "烏梅、黃連、黃柏、人參、當歸、附子、桂枝、蜀椒、干薑、細辛" },
  { name: "少腹逐瘀湯", ingredients: "小茴香、干薑、延胡索、沒藥、當歸、川芎、肉桂、赤芍藥、蒲黃、五靈脂" },
  { name: "水紅花膏", ingredients: "紅蓼子、大黃、朴硝、山梔、石灰、酒酵" },
  { name: "水陸二仙丹", ingredients: "金櫻子、芡實" },
  { name: "玉女煎", ingredients: "石膏、熟地黃、麥冬、知母、牛膝" },
  { name: "玉樞丹", ingredients: "山慈姑、續隨子、大戟、麝香、續米、朱砂、五倍子" },
  { name: "玉屏風散", ingredients: "黃芪、白術、防風" },
  { name: "正氣天香散", ingredients: "烏藥、香附、干紫蘇、陳皮" },
  { name: "正氣散", ingredients: "厚朴、蒼術、陳皮、甘草、藿香、佩蘭、蒼術、半夏、檳榔、荷葉" },
  { name: "本事地黃湯", ingredients: "生干地黃、桑白皮、磁石、枳殼、羌活、防風、黃芩、木通、炒白術" },
  { name: "石葦散", ingredients: "石葦、冬葵子、瞿麥、滑石、車前子" },
  { name: "龍虎丸", ingredients: "牛黃、巴豆霜、辰砂、雄黃" },
  { name: "龍膽瀉肝湯", ingredients: "龍膽草、澤瀉、木通、車前子、當歸、柴胡、生地黃、梔子" },
  { name: "左歸丸", ingredients: "熟地黃、山藥、山茱萸、菟絲子、枸杞子、川牛膝、鹿角膠、龜版膠" },
  { name: "左歸飲", ingredients: "熟地、山茱萸、枸杞子、山藥、茯苓、甘草" },
  { name: "左金丸", ingredients: "黃連、吳茱萸" },
  { name: "右歸丸", ingredients: "熟地黃、山藥、山茱萸、枸杞子、杜仲、菟絲子、附子、肉桂、當歸、鹿角膠" },
  { name: "右歸飲", ingredients: "熟地、山茱萸、枸杞子、山藥、茯苓、甘草" },
  { name: "平胃散", ingredients: "蒼術、厚朴、橘皮、甘草、生薑、大棗" },
  { name: "平喘固本湯", ingredients: "黨參、五味子、冬虫夏草、胡桃肉、沉香、磁石、坎炁、蘇子、款冬花、法半夏、橘紅" },
  { name: "甘麥大棗湯", ingredients: "甘草、淮曉麥、大棗" },
  { name: "甘草湯", ingredients: "甘草、干薑" },
  { name: "甘草瀉心湯", ingredients: "炙甘草、黃芩、大棗、干薑、半夏、黃連、人參" },
  { name: "甘草干薑茯苓白術湯", ingredients: "甘草、干薑、茯苓、白術" },
  { name: "甘遂半夏湯", ingredients: "甘遂、半夏、芍藥、甘草" },
  { name: "甘露消毒丹", ingredients: "滑石、茵陳、黃芩、石菖蒲、川貝母、木通、藿香、射干、連翹、薄荷、白蔻仁" },
  { name: "四七湯", ingredients: "蘇葉、制半夏、厚朴、茯苓、生薑、大棗" },
  { name: "四妙丸", ingredients: "蒼術、黃柏、牛膝、苡仁" },
  { name: "四君子湯", ingredients: "黨參、白術、茯苓、甘草" },
  { name: "四味回陽飲", ingredients: "人參、制附子、炮薑、炙甘草" },
  { name: "四物湯", ingredients: "當歸、白芍藥、川芎、熟地黃" },
  { name: "四神丸", ingredients: "補骨脂、肉豆蔻、吳茱萸、五味子、生大棗" },
  { name: "四海舒郁丸", ingredients: "海蛤粉、海帶、海藻、海螵蛸、昆布、陳皮、青木香" },
  { name: "生脈散", ingredients: "人參、麥冬、五味子" },
  { name: "生鐵落飲", ingredients: "天冬、麥冬、貝母、膽星、橘紅、遠志、石菖蒲、連翹、茯苓、茯神、玄參、鉤藤、丹參、辰砂、生鐵落" },
  { name: "生薑甘草湯", ingredients: "人參、甘草、生薑、大棗" },
  { name: "失笑散", ingredients: "五靈脂、蒲黃" },
  { name: "代抵當丸", ingredients: "大黃、歸尾、生地、穿山甲、芒硝、桃仁、肉桂" },
  { name: "白頭翁湯", ingredients: "白頭翁、黃柏、黃連、秦皮" },
  { name: "白及枇杷丸", ingredients: "白及、蛤粉、炒阿膠、生地、藕節、枇杷葉" },
  { name: "白金丸", ingredients: "白礬、郁金" },
  { name: "白虎加人參湯", ingredients: "知母、石膏、甘草、粳米、人參" },
  { name: "白虎加桂枝湯", ingredients: "知母、石膏、甘草、粳米、桂枝" },
  { name: "半夏白術天麻湯", ingredients: "半夏、白術、天麻、陳皮、茯苓、甘草、生薑、大棗" },
  { name: "半夏厚朴湯", ingredients: "半夏、厚朴、紫蘇、茯苓、生薑" },
  { name: "半夏秫米湯", ingredients: "半夏、秫米" },
  { name: "半硫丸", ingredients: "半夏、硫黃" },
  { name: "歸脾湯", ingredients: "黨參、黃芪、白術、茯神、酸棗仁、龍眼肉、木香、炙甘草、當歸、遠志、生薑、大棗" },
  { name: "加味二妙散", ingredients: "黃柏、蒼術、當歸、牛膝、防己、萆薢、龜版" },
  { name: "加味四斤丸", ingredients: "肉苁蓉、牛膝、菟絲子、木瓜、鹿茸、熟地、天麻、五味子" },
  { name: "加味四君子湯", ingredients: "人參、茯苓、白術、炙草、黃芪、白扁豆" },
  { name: "加味四物湯", ingredients: "白芍、當歸、生地、川芎、蔓荊子、菊花、黃芩、甘草" },
  { name: "加味百花膏", ingredients: "紫菀、款冬花、百部、薑、梅" },
  { name: "加味桔梗湯", ingredients: "桔梗、甘草、貝母、橘紅、紅花、苡仁、葶藶子、白及" },
  { name: "加味清胃散", ingredients: "生地、丹皮、當歸、黃連、連翹、犀角、升麻、甘草" },
  { name: "加減承氣湯", ingredients: "大黃、風化硝、枳實、礞石、皂角、豬膽汁" },
  { name: "加減瀉白散", ingredients: "桑白皮、地骨皮、甘草、青皮、陳皮、五味子、人參、白茯苓" },
  { name: "加減葳蕤湯", ingredients: "玉竹、蔥白、桔梗、白薇、豆豉、薄荷、炙甘草、大棗" },
  { name: "百合固金丸", ingredients: "生地黃、熟地黃、麥冬、貝母、百合、當歸、炒芍藥、甘草、玄參、桔梗" },
  { name: "地黃飲子", ingredients: "生地黃、巴戟天、山茱萸、石斛、肉苁蓉、五味子、肉桂、茯苓、麥冬、炮附子、石菖蒲、遠志、生薑、大棗、薄荷" },
  { name: "地榆散", ingredients: "地榆、茜根、黃芩、黃連、山梔、茯苓" },
  { name: "芎芷石膏湯", ingredients: "川芎、白芷、石膏、菊花、藁本、羌活" },
  { name: "芍藥湯", ingredients: "黃芩、芍藥、炙甘草、黃連、大黃、檳榔、當歸、木香、肉桂" },
  { name: "芍藥甘草湯", ingredients: "白芍藥、炙甘草" },
  { name: "耳聾左慈丸", ingredients: "熟地黃、山茱萸、山藥、牡丹皮、茯苓、澤瀉、柴胡、磁石" },
  { name: "如金解毒散", ingredients: "桔梗、甘草、黃芩、黃連、黃柏、山梔" },
  { name: "貞元飲", ingredients: "熟地黃、炙甘草、當歸" },
  { name: "至寶丹", ingredients: "朱砂、麝香、安息香、金銀箔、犀角、牛黃、琥珀、雄黃、玳瑁、龍腦" },
  { name: "羊肝丸", ingredients: "夜明砂、蟬蛻、木賊草、當歸、羊肝" },
  { name: "交泰丸", ingredients: "黃連、肉桂" },
  { name: "安宮牛黃丸", ingredients: "牛黃、郁金、犀角、黃連、朱砂、冰片、珍珠、山梔、雄黃、黃芩、麝香、金箔衣" },
  { name: "安神定志丸", ingredients: "茯苓、茯神、遠志、人參、石菖蒲、龍齒" },
  { name: "當歸六黃湯", ingredients: "當歸、生地黃、熟地黃、黃連、黃芩、黃柏、黃芪" },
  { name: "當歸龍薈丸", ingredients: "當歸、龍膽草、梔子、黃連、黃芩、黃柏、大黃、青黛、蘆薈、木香、麝香" },
  { name: "當歸補血湯", ingredients: "黃芪、當歸" },
  { name: "竹葉石膏湯", ingredients: "竹葉、石膏、麥冬、人參、半夏、粳米、炙甘草" },
  { name: "竹瀝達痰丸", ingredients: "青礞石、沉香、大黃、黃芩、竹瀝、半夏、橘紅、甘草、姜汁、茯苓、人參" },
  { name: "竹茹湯", ingredients: "竹茹、半夏、干薑、甘草、生薑、大棗" },
  { name: "朱砂安神丸", ingredients: "黃連、朱砂、生地黃、歸身、炙甘草" },
  { name: "血府逐瘀湯", ingredients: "當歸、生地黃、桃仁、紅花、枳殼、赤芍藥、柴胡、甘草、桔梗、川芎、牛膝" },
  { name: "舟車丸", ingredients: "甘遂、芫花、大戟、大黃、黑丑、木香、青皮、陳皮、輕粉、檳榔" },
  { name: "行軍散", ingredients: "牛黃、麝香、珍珠、冰片、硼砂、雄黃、火硝、金箔" },
  { name: "導赤散", ingredients: "生地黃、木通、竹葉、甘草" },
  { name: "導痰湯", ingredients: "半夏、陳皮、枳實、茯苓、甘草、制南星" },
  { name: "防已黃芪湯", ingredients: "防已、白術、黃芪、甘草、生薑、大棗" },
  { name: "防風湯", ingredients: "防風、當歸、赤茯苓、杏仁、黃芩、秦艽、葛根、麻黃、肉桂、生薑、甘草、大棗" },
  { name: "紅靈丹", ingredients: "朱砂、麝香、銀硝、礞石、雄黃、硼砂、冰片" },
  { name: "醫方集解六君子湯", ingredients: "人參、白術、茯苓、甘草、黃芪、山藥" },
  { name: "麥門冬湯", ingredients: "麥冬、人參、半夏、甘草、粳米、大棗" },
  { name: "麥味地黃丸", ingredients: "熟地黃、山茱萸、山藥、丹皮、澤瀉、茯苓、麥冬、五味子" },
  { name: "蒼術二陳湯", ingredients: "蒼術、白術、茯苓、陳皮、甘草、半夏" },
  { name: "蒼術難名丹", ingredients: "蒼術、茴香、川楝子、川烏、破故紙、白茯苓、龍骨" },
  { name: "蘇子降氣湯", ingredients: "蘇子、橘皮、半夏、當歸、前胡、厚朴、肉桂、甘草、生薑" },
  { name: "蘇合香丸", ingredients: "白術、青木香、犀角、香附、朱砂、訶子、檳榔、安息香、沉香、麝香、丁香、蓽撥、蘇合香油、薰陸香、冰片" },
  { name: "杞菊地黃丸", ingredients: "枸杞子、菊花、熟地黃、山茱萸、山藥、澤瀉、丹皮、茯苓" },
  { name: "杏蘇二陳丸", ingredients: "杏仁、半夏、陳皮、茯苓、蘇子、甘草" },
  { name: "杏蘇散", ingredients: "杏仁、紫蘇葉、橘皮、半夏、生薑、枳殼、桔梗、前胡、茯苓、甘草、大棗" },
  { name: "更衣丸", ingredients: "蘆薈、朱砂" },
  { name: "來復丹", ingredients: "玄精石、硝石、硫黃、橘皮、青皮、五靈脂" },
  { name: "妙香散", ingredients: "山藥、茯苓、茯神、遠志、黃芪、人參、桔梗、甘草、木香、辰砂、麝香" },
  { name: "連理湯", ingredients: "人參、白術、干薑、炙甘草、黃連、茯苓" },
  { name: "吳茱萸湯", ingredients: "吳茱萸、人參、生薑、大棗" },
  { name: "沉香降氣散", ingredients: "沉香、砂仁、甘草、香附、川楝子、玄胡索" },
  { name: "沉香散", ingredients: "沉香、石滑石、當歸、橘皮、白芍、冬葵子、甘草、王不留行" },
  { name: "沙參麥冬湯", ingredients: "沙參、麥冬、玉竹、桑葉、甘草、天花粉、生扁豆" },
  { name: "沙參清肺湯", ingredients: "北沙參、生黃芪、太子參、合歡皮、白及、生甘草、桔梗、苡仁、冬瓜子" },
  { name: "良附丸", ingredients: "高良薑、香附" },
  { name: "啟膈散", ingredients: "沙參、茯苓、丹參、川貝、郁金、砂仁、殼、荷葉蒂、杵頭糠" },
  { name: "補天大造丸", ingredients: "人參、白術、當歸、枣仁、炙黃芪、遠志、白芍、山藥、茯苓、杞子、紫河車、龜版、鹿角、大熟地" },
  { name: "補中益氣湯", ingredients: "人參、黃芪、白術、甘草、當歸、陳皮、升麻、柴胡" },
  { name: "補氣運脾湯", ingredients: "人參、白術、茯苓、甘草、黃芪、陳皮、砂仁、半夏曲、生薑、大棗" },
  { name: "補陽還五湯", ingredients: "當歸尾、川芎、黃芪、桃仁、地龍、赤芍、紅花" },
  { name: "補肝湯", ingredients: "當歸、白芍、川芎、熟地、酸棗仁、木瓜、炙甘草" },
  { name: "補肺湯", ingredients: "人參、黃芪、熟地、五味子、紫菀、桑白皮" },
  { name: "終絲補管湯", ingredients: "牡蠣、龍骨、山藥、萸肉、三七" },
  { name: "牡蠣散", ingredients: "煅牡蠣、黃芪、麻黃根、浮小麥" },
  { name: "何人飲", ingredients: "何首烏、人參、當歸、陳皮、生薑" },
  { name: "皂莢丸", ingredients: "皂莢、大棗" },
  { name: "身痛逐瘀湯", ingredients: "秦艽、川芎、桃仁、紅花、甘草、羌活、沒藥、香附、五靈脂、牛膝、地龍、當歸" },
  { name: "附子理中丸", ingredients: "炮附子、人參、白術、炮薑、炙甘草" },
  { name: "附子粳米湯", ingredients: "炮附子、粳米、半夏、甘草、大棗" },
  { name: "阿魏膏", ingredients: "羌活、獨活、玄參、官桂、赤芍、穿山甲、蘇合油、生地、蜣螂、大黃、白芷、天麻、紅花、麝香、土木鱉、黃丹、芒硝、阿魏、乳香、沒藥" },
  { name: "純陽正氣丸", ingredients: "陳皮、丁香、茯苓、茅術、白木、香、半夏、肉桂、青木香、花椒、葉、紅靈丹" },
  { name: "背娥丸", ingredients: "補骨脂、杜仲、胡桃肉、大蒜頭" },
  { name: "青麟丸", ingredients: "大黃、側柏葉、綠豆、黃豆、槐枝、桑葉、桃葉、柳葉、早車前、鮮茴香、陳皮、荷葉、銀花、蘇葉、冬術、艾葉、半夏、厚朴、黃芩、香附、砂仁、甘草、澤瀉、豬苓、乳、蘇葉、梨汁、藕汁、童便、陳酒" },
  { name: "苓甘五味姜辛湯", ingredients: "茯苓、甘草、五味子、干薑、細辛" },
  { name: "苓桂術甘湯", ingredients: "茯苓、桂枝、白術、甘草" },
  { name: "枕中丹", ingredients: "龜版、龍骨、遠志、菖蒲" },
  { name: "虎潛丸", ingredients: "龜版、黃柏、知母、熟地黃、白芍藥、鎖陽、陳皮、虎骨、干薑" },
  { name: "河車大造丸", ingredients: "紫河車、熟地黃、杜仲、天冬、麥冬、龜版、黃柏、牛膝" },
  { name: "瀉心湯", ingredients: "大黃、黃芩、黃連" },
  { name: "瀉白散", ingredients: "桑白皮、地骨皮、生甘草、粳米" },
  { name: "羌活勝濕湯", ingredients: "羌活、獨活、川芎、蔓荊子、甘草、防風、藁本" },
  { name: "定志丸", ingredients: "黨參、茯神、石菖蒲、遠志、甘草、茯苓、白術、天冬" },
  { name: "定癇丸", ingredients: "天麻、川貝、膽星、姜、半夏" },
  { name: "定喘湯", ingredients: "白果、麻黃、桑白皮、款冬花、半夏、杏仁、蘇子、黃芩、甘草" },
  { name: "實脾飲", ingredients: "附子、干薑、白術、甘草、厚朴、木香、草果、檳榔、木瓜、生薑、大棗、茯苓" },
  { name: "知柏地黃丸", ingredients: "知母、黃柏、熟地黃、山茱萸、山藥、茯苓、丹皮、澤瀉" },
  { name: "金鈴子散", ingredients: "金鈴子、延胡索" },
  { name: "金匱腎氣丸", ingredients: "桂枝、附子、熟地黃、山茱萸、山藥、茯苓、丹皮、澤瀉" },
  { name: "金鎖固精丸", ingredients: "沙苑蒺藜、芡實、蓮須、龍骨、牡蠣、蓮肉" },
  { name: "炙甘草湯", ingredients: "炙甘草、人參、桂枝、生薑、阿膠、生地黃、麥冬、火麻仁、大棗" },
  { name: "駐車丸", ingredients: "黃連、阿膠、當歸、干薑" },
  { name: "參附湯", ingredients: "人參、熟附子、棗" },
  { name: "參蘇飲", ingredients: "人參、蘇葉、葛根、前胡、法半夏、茯苓、橘紅、甘草、桔梗、枳殼、木香、陳皮、薑、棗" },
  { name: "參苓白術散", ingredients: "人參、茯苓、白術、桔梗、山藥、甘草、白扁豆、蓮子肉、砂仁、薏苡仁" },
  { name: "參蛤散", ingredients: "人參、蛤蚧" },
  { name: "春澤湯", ingredients: "白術、桂枝、豬苓、澤瀉、茯苓、人參" },
  { name: "柏葉湯", ingredients: "側柏葉、干薑、艾葉、馬通汁" },
  { name: "枳實導滯丸", ingredients: "大黃、枳實、黃芩、黃連、神曲、白術、茯苓、澤瀉" },
  { name: "荊防敗毒散", ingredients: "荊芥、防風、羌活、獨活、柴胡、前胡、川芎、枳殼、茯苓、桔梗、甘草" },
  { name: "茵陳五苓散", ingredients: "茵陳蒿、桂枝、茯苓、白術、澤瀉、豬苓" },
  { name: "茵陳術附湯", ingredients: "茵陳蒿、白術、附子、干薑、炙甘草、肉桂" },
  { name: "茵陳蒿湯", ingredients: "茵陳蒿、山梔、大黃" },
  { name: "茜根散", ingredients: "茜草根、黃芩、阿膠、側柏葉、生地黃、甘草" },
  { name: "封髓丹", ingredients: "黃柏、砂仁、甘草" },
  { name: "指迷茯苓丸", ingredients: "茯苓、枳殼、半夏、風化硝、生薑" },
  { name: "拯陽理勞湯", ingredients: "人參、黃芪、肉桂、當歸、白術、甘草、陳皮、五味子、生薑、大棗" },
  { name: "牵正散", ingredients: "白附子、僵蠶、全蠍" },
  { name: "厚朴湯", ingredients: "高良薑、厚朴、朴硝、大黃" },
  { name: "胃苓湯", ingredients: "蒼術、厚朴、陳皮、甘草、生薑、大棗、桂枝、白術、澤瀉、茯苓、豬苓" },
  { name: "濟川煎", ingredients: "當歸、牛膝、肉苁蓉、澤瀉、升麻、枳殼" },
  { name: "濟生腎氣丸", ingredients: "地黃、山藥、山茱萸、丹皮、茯苓、澤瀉、炮附子、桂枝、牛膝、車前子" },
  { name: "活人敗毒散", ingredients: "人參、羌活、獨活、前胡、柴胡、川芎、枳殼、桔梗、茯苓、炙草、生薑" },
  { name: "養心湯", ingredients: "黃芪、茯苓、茯神、當歸、川芎、炙甘草、半夏曲、柏子仁、酸棗仁、遠志、五味子、人參、肉桂" },
  { name: "宣痺湯", ingredients: "防己、杏仁、連翹、滑石、薏苡仁、半夏、蠶沙、赤小豆皮、梔子" },
  { name: "神術散", ingredients: "蒼術、陳皮、厚朴、甘草、藿香、砂仁" },
  { name: "神丹", ingredients: "犀角、石菖蒲、黃芩、生地黃、銀花、金汁、連翹、板藍根、豆豉、玄參、天花粉、紫草" },
  { name: "香連丸", ingredients: "黃連、木香" },
  { name: "香蘇散", ingredients: "香附、紫蘇莖葉、陳皮、甘草" },
  { name: "香附旋復花湯", ingredients: "生香附、旋復花、蘇子、薏苡仁、半夏、茯苓、橘皮" },
  { name: "香茸丸", ingredients: "麝香、茸、秦艽、苁蓉、熟地、沉香、五味子、茯苓、龍骨" },
  { name: "香砂六君子湯", ingredients: "木香、砂仁、陳皮、半夏、黨參、白術、茯苓、甘草" },
  { name: "復元活血湯", ingredients: "柴胡、栝樓根、當歸、紅花、甘草、穿山甲、大黃、桃仁" },
  { name: "順氣導痰湯", ingredients: "半夏、陳皮、茯苓、甘草、生薑、膽星、枳實、木香、香附" },
  { name: "保元湯", ingredients: "人參、黃芪、肉桂、甘草、生薑" },
  { name: "保和丸", ingredients: "神曲、山楂、茯苓、半夏、陳皮、連翹、萊菔子" },
  { name: "保真湯", ingredients: "人參、黃芪、白術、甘草、赤白茯苓、五味子、當歸、生地黃、熟地、天冬、麥冬、赤芍藥、白芍藥、柴胡、厚朴、地骨皮、黃柏、知母、蓮心、陳皮、枣" },
  { name: "獨參湯", ingredients: "人參" },
  { name: "獨活寄生湯", ingredients: "獨活、桑寄生、秦艽、防風、細辛、當歸、芍藥、川芎、干地黃、杜仲、牛膝、人參、茯苓、甘草、肉桂心" },
  { name: "追蟲丸", ingredients: "檳榔、雷丸、南木香、苦楝根、皂莢、黑丑、茵陳" },
  { name: "迴道驅蛔湯", ingredients: "木香、延胡索、厚朴、檳榔、使君子、苦楝皮、大黃" },
  { name: "秦艽鼈甲散", ingredients: "地骨皮、柴胡、秦艽、知母、當歸、鼈甲、青蒿、烏梅" },
  { name: "真人養臟湯", ingredients: "訶子、罂粟殼、肉豆蔻、白術、人參、木香、官桂、炙甘草、生薑、大棗" },
  { name: "真武湯", ingredients: "炮附子、白術、茯苓、芍藥、生薑" },
  { name: "桂枝湯", ingredients: "桂枝、芍藥、生薑、炙甘草、大棗" },
  { name: "桂枝甘草龍骨牡蠣湯", ingredients: "桂枝、炙甘草、龍骨、牡蠣" },
  { name: "桂枝加厚朴杏仁湯", ingredients: "桂枝、芍藥、炙甘草、生薑、大棗、厚朴、杏仁" },
  { name: "桂枝芍藥知母湯", ingredients: "桂枝、芍藥、炙甘草、麻黃、白術、知母、防風、炮附子、生薑" },
  { name: "桃紅飲", ingredients: "桃仁、紅花、川芎、當歸、尾威靈仙" },
  { name: "桃花湯", ingredients: "赤石脂、干薑、粳米" },
  { name: "桃仁紅花煎", ingredients: "丹參、赤芍、桃仁、紅花、制香附、延胡索、青皮、當歸、川芎、生地" },
  { name: "桔梗白散", ingredients: "桔梗、貝母、巴豆" },
  { name: "桔梗杏仁煎", ingredients: "桔梗、杏仁、甘草、銀花、貝母、枳殼、紅藤、連翹、夏枯草、百合、麥冬、阿膠" },
  { name: "栝樓桂枝湯", ingredients: "栝樓根、桂枝、芍藥、甘草、生薑、大棗" },
  { name: "栝樓薤白半夏湯", ingredients: "栝樓、薤白、白酒、半夏" },
  { name: "栝樓薤白白酒湯", ingredients: "栝樓、薤白、白酒" },
  { name: "柴胡桂枝干薑湯", ingredients: "柴胡、桂枝、干薑、黃芩、栝樓根、牡蠣、炙甘草" },
  { name: "柴胡疏肝散", ingredients: "柴胡、枳殼、芍藥、甘草、香附、川芎" },
  { name: "柴胡清骨散", ingredients: "秦艽、鼈甲、柴胡、地骨皮、青蒿、知母、胡黃連、韭白、甘草、童便、豬脊髓、豬膽汁" },
  { name: "柴胡截瘧飲", ingredients: "柴胡、黃芩、人參、甘草、半夏、常山、烏梅、檳榔、桃仁、生薑、大棗" },
  { name: "柴胡半夏湯", ingredients: "柴胡、黃芩、半夏、栝樓仁、枳殼、桔梗、杏仁、青皮、甘草" },
  { name: "海藏紫菀湯", ingredients: "紫菀、知母、貝母、桔梗、阿膠、五味子、茯苓、甘草、人參" },
  { name: "海藻玉壺湯", ingredients: "海藻、昆布、海帶、半夏、陳皮、青皮、連翹、象貝、當歸、川芎、獨活、甘草" },
  { name: "潤腸丸", ingredients: "當歸、生地、麻仁、桃仁、枳殼" },
  { name: "滌痰湯", ingredients: "制半夏、南星、陳皮、枳實、茯苓、人參、石菖蒲、竹茹、甘草、生薑" },
  { name: "消渴方", ingredients: "黃連末、天花粉末、生地汁、藕汁、人乳汁、薑汁、蜂蜜" },
  { name: "益氣聰明湯", ingredients: "黃芪、人參、升麻、葛根、蔓荊子、芍藥、黃柏、炙甘草" },
  { name: "益胃湯", ingredients: "沙參、麥冬、生地黃、玉竹、冰糖" },
  { name: "燒鹽探吐法", ingredients: "燒鹽" },
  { name: "調營飲", ingredients: "莪術、川芎、當歸、延胡、赤芍藥、大黃、檳榔、陳皮、大腹皮、葶藶、赤茯苓、桑白皮、細辛、官桂、炙甘草、大棗、白芷" },
  { name: "調營斂肝飲", ingredients: "當歸、白芍、蛤粉炒、阿膠、枸杞子、五味子、川芎、枣仁、茯苓、陳皮、木香、生薑、大棗" },
  { name: "蠶矢湯", ingredients: "晚蠶砂、陳木瓜、薏苡仁、大豆黃卷、黃連、制半夏、黃芩、通草" },
  { name: "射干麻黃湯", ingredients: "射干、麻黃、細辛、紫菀、款冬花、半夏、五味子、生薑、大棗" },
  { name: "皺肺丸", ingredients: "五味子、人參、桂枝、款冬花、紫菀、白石英、鵝管石、杏仁" },
  { name: "逍遙散", ingredients: "柴胡、白術、白芍藥、當歸、茯苓、炙甘草、薄荷、煨薑" },
  { name: "通幽湯", ingredients: "生地黃、熟地黃、桃仁泥、紅花、當歸、炙甘草、升麻" },
  { name: "通脈四逆湯", ingredients: "生附子、干薑、炙甘草、蔥白" },
  { name: "通脈四逆加豬膽汁湯", ingredients: "炙甘草、干薑、生附子、豬膽汁" },
  { name: "通竅活血湯", ingredients: "赤芍藥、川芎、桃仁、紅花、麝香、老蔥、鮮薑、大棗、酒" },
  { name: "通瘀煎", ingredients: "歸尾、山楂、香附、紅花、烏藥、青皮、木香、澤瀉" },
  { name: "桑白皮湯", ingredients: "桑白皮、半夏、蘇子、杏仁、貝母、黃芩、黃連、山梔" },
  { name: "桑杏湯", ingredients: "桑葉、杏仁、沙參、浙貝母、豆豉、山梔皮、梨皮" },
  { name: "桑菊飲", ingredients: "桑葉、菊花、連翹、薄荷、桔梗、杏仁、蘆根、甘草" },
  { name: "桑螵蛸散", ingredients: "桑螵蛸、遠志、菖蒲、龍骨、人參、茯神、當歸、龜版" },
  { name: "理中丸", ingredients: "人參、白術、干薑、炙甘草" },
  { name: "黃土湯", ingredients: "灶心黃土、甘草、干地黃、白術、炮附子、阿膠、黃芩" },
  { name: "黃連上清丸", ingredients: "黃芩、黃連、黃柏、梔子、菊花、桔梗、薄荷、川芎、大黃、連翹、當歸、葛根、玄參、花粉、連翹、黃連" },
  { name: "黃連阿膠湯", ingredients: "黃連、阿膠、黃芩、雞子黃、芍藥" },
  { name: "黃連香薷飲", ingredients: "黃連、香薷、厚朴" },
  { name: "黃連清心飲", ingredients: "黃連、生地黃、當歸、甘草、酸棗仁、茯神、遠志、人參、蓮子肉" },
  { name: "黃連溫膽湯", ingredients: "半夏、陳皮、茯苓、甘草、枳實、竹茹、黃連、大棗" },
  { name: "黃芪六一湯", ingredients: "黃芪、甘草" },
  { name: "黃芪湯", ingredients: "黃芪、陳皮、火麻仁、白蜜" },
  { name: "黃芪建中湯", ingredients: "黃芪、白芍、桂枝、炙甘草、生薑、大棗、飴糖" },
  { name: "黃芪鼈甲散", ingredients: "黃芪、鼈甲、天冬、地骨皮、秦艽、柴胡、紫菀、半夏、茯苓、知母、生地、白芍、桑白皮、人參、肉桂、桔梗、甘草" },
  { name: "黃病絳礬丸", ingredients: "厚朴、茅術、陳皮、甘草、絳礬、紅棗" },
  { name: "菟絲子丸", ingredients: "菟絲子、澤瀉、鹿茸、石龍齒、肉桂、附子、石斛、熟地黃、茯苓、續斷、山茱萸、肉苁蓉、防風、杜仲、牛膝、補骨脂、蓽澄茄、沉香、巴戟天、茴香、五味子、桑螵蛸、川芎、覆盆子" },
  { name: "梔子柏皮湯", ingredients: "梔子、甘草、黃柏" },
  { name: "梔子清肝湯", ingredients: "梔子、丹皮、柴胡、當歸、芍藥、茯苓、川芎、牛蒡子、甘草" },
  { name: "控涎丹", ingredients: "甘遂、大戟、白芥子" },
  { name: "鹿角膠丸", ingredients: "鹿角膠、鹿角霜、熟地黃、川牛膝、白茯苓、菟絲子、人參、當歸、白術、杜仲、虎脛骨、龜版" },
  { name: "鹿茸丸", ingredients: "鹿茸、麥冬、熟地黃、黃芪、五味子、肉苁蓉、雞內金、山茱萸、補骨脂、人參、牛膝、玄參、茯苓、地骨皮" },
  { name: "鹿茸補澀丸", ingredients: "人參、黃芪、菟絲子、桑螵蛸、蓮肉、茯苓、肉桂、山藥、附子、鹿茸、桑皮、龍骨、補骨脂、五味子" },
  { name: "麻子仁丸", ingredients: "麻子仁、芍藥、炙枳實、大黃、炙厚朴、杏仁" },
  { name: "麻杏石甘湯", ingredients: "麻黃、杏仁、石膏、炙甘草" },
  { name: "麻黃湯", ingredients: "麻黃、桂枝、杏仁、炙甘草" },
  { name: "麻黃連翹赤小豆湯", ingredients: "麻黃、杏仁、生梓白皮、連軺、赤小豆、甘草、生薑、大棗" },
  { name: "麻黃附子細辛湯", ingredients: "麻黃、附子、細辛" },
  { name: "旋復代赭湯", ingredients: "旋復花、代赭石、人參、半夏、炙甘草、生薑、大棗" },
  { name: "旋復花湯", ingredients: "旋復花、新絳、蔥" },
  { name: "羚羊角湯", ingredients: "羚羊角、龜版、生地、丹皮、白芍、柴胡、薄荷、蟬衣、菊花、夏枯草、石決明" },
  { name: "羚羊鉤藤湯", ingredients: "羚羊角、桑葉、川貝、鮮生地、鉤藤、菊花、白芍藥、生草、鮮竹茹、茯神" },
  { name: "清金化痰湯", ingredients: "黃芩、山梔、桔梗、麥冬、桑白皮、貝母、知母、栝樓仁、橘紅、茯苓、甘草" },
  { name: "清肺飲", ingredients: "茯苓、黃芩、桑白皮、麥冬、車前子、山梔、木通" },
  { name: "清胃散", ingredients: "當歸、生地黃、牡丹皮、升麻、黃連" },
  { name: "清骨散", ingredients: "銀柴胡、胡黃連、秦艽、鼈甲、地骨皮、青蒿、知母、甘草" },
  { name: "清暑湯", ingredients: "升麻、蒼術、荷葉" },
  { name: "清瘴湯", ingredients: "青蒿、柴胡、茯苓、知母、陳皮、半夏、黃芩、黃連、枳實、常山、竹茹、益元散" },
  { name: "清燥救肺湯", ingredients: "桑葉、石膏、杏仁、甘草、麥冬、人參、阿膠、炒胡麻仁、炙枇杷葉" },
  { name: "銀翹散", ingredients: "金銀花、連翹、豆豉、牛蒡子、薄荷、荊芥穗、桔梗、甘草、竹葉、鮮蘆根" },
  { name: "豬肚丸", ingredients: "白術、苦參、牡蠣、豬肚" },
  { name: "豬苓湯", ingredients: "豬苓、茯苓、澤瀉、阿膠、滑石" },
  { name: "瓊玉膏", ingredients: "生地黃汁、茯苓、人參、白蜜" },
  { name: "斑龍丸", ingredients: "熟地黃、菟絲子、補骨脂、柏子仁、茯苓、鹿角膠、鹿角霜" },
  { name: "琥珀多寐丸", ingredients: "琥珀、黨參、茯苓、遠志、羚羊角、甘草" },
  { name: "葛根湯", ingredients: "葛根、麻黃、桂枝、生薑、甘草、芍藥、大棗" },
  { name: "葛根芩連湯", ingredients: "葛根、黃芩、黃連、炙甘草" },
  { name: "葶藶大棗瀉肺湯", ingredients: "葶藶子、大棗" },
  { name: "蔥豉桔梗湯", ingredients: "蔥白、豆豉、薄荷、連翹、梔子、竹葉、桔梗、甘草" },
  { name: "越婢加術湯", ingredients: "麻黃、石膏、甘草、大棗、白術、生薑" },
  { name: "越婢加半夏湯", ingredients: "麻黃、石膏、生薑、大棗、甘草、半夏" },
  { name: "越鞠丸", ingredients: "川芎、蒼術、香附、炒山梔、神曲" },
  { name: "椒目瓜藶湯", ingredients: "川椒目、瓜藶仁、葶藶子、桑白皮、蘇子、半夏、茯苓、橘紅、蒺藜、生薑" },
  { name: "硝石礬石散", ingredients: "硝石、礬石" },
  { name: "紫金丹", ingredients: "信砒、豆豉" },
  { name: "紫雪丹", ingredients: "滑石、石膏、寒水石、磁石、羚羊角、青木香、犀角、沉香、丁香、升麻、玄參、甘草、朴硝、朱砂、麝香、黃金" },
  { name: "黑錫丹", ingredients: "黑錫、硫黃、川楝子、胡蘆巴、木香、炮附子、肉豆蔻、陽起石、沉香、茴香、肉桂、補骨脂" },
  { name: "痛瀉要方", ingredients: "白術、白芍、防風、炒陳皮" },
  { name: "溫膽湯", ingredients: "半夏、橘皮、甘草、枳實、竹茹、生薑、茯苓" },
  { name: "溫脾湯", ingredients: "附子、人參、大黃、甘草、干薑" },
  { name: "滋水清肝飲", ingredients: "生地黃、山茱萸、茯苓、歸身、山藥、丹皮、澤瀉、白芍、柴胡、枣仁、山酸棗仁" },
  { name: "滋腎通關丸", ingredients: "知母、黃柏、肉桂" },
  { name: "程氏萆薢分清飲", ingredients: "萆薢、車前子、茯苓、蓮子心、薏苡、黃柏、丹參、白術" },
  { name: "犀角生地黃湯", ingredients: "犀角、生地黃、丹皮、芍藥" },
  { name: "犀角散", ingredients: "犀角、黃連、升麻、山栀、茵陳" },
  { name: "單黃丸", ingredients: "雄黃、麝香、沒藥、乳香" },
  { name: "疏鑿飲子", ingredients: "商陸、澤瀉、赤小豆、椒目、木通、茯苓皮、大腹皮、檳榔、生薑、羌活、秦艽" },
  { name: "普濟消毒飲", ingredients: "黃芩、黃連、連翹、玄參、板藍根、馬勃、牛蒡子、僵蠶、升麻、柴胡、陳皮、桔梗、甘草、薄荷" },
  { name: "摘瘻散", ingredients: "細辛、皂角、半夏" },
  { name: "暖肝煎", ingredients: "肉桂、小茴香、茯苓、枸杞子、當歸、沉香、生薑、藥" },
  { name: "新加香薷飲", ingredients: "香薷、扁豆花、厚朴、金銀花、連翹" },
  { name: "辟瘟丹", ingredients: "羚羊角、朴硝、牙皂、廣木香、藿香、茜草、郁金、黃連、犀角、川朴、川烏、玳瑁、大黃、麝香、玄精石、金箔、茯苓、香附、桂心、赤小豆、降香、鬼箭羽、朱砂、毛茨菇、火硝、桑皮、干金、桃仁、霜檳榔、三棱、莪術、胡椒、葶藶子、牛黃、巴豆霜、細辛、白芍、公丁香、當歸、余糧、滑石、山豆根、麻黃、蒼術、安息、干薑、黃丹、參、天麻、升麻、柴胡、紫蘇、川芎、草河車、檀香、桔梗、白芷、紫菀、芫花、雌黃、琥珀、冰片、陳皮、腰黃、斑蝥、蜈蚣、石龍子" },
  { name: "解語丹", ingredients: "白附子、石菖蒲、遠志、天麻、全蠍、羌活、南星、木香、甘草" },
  { name: "截瘧七寶飲", ingredients: "常山、草果、厚朴、檳榔、青皮、陳皮、炙甘草" },
  { name: "槐角丸", ingredients: "槐角、地榆、黃芩、當歸、炒枳殼、防風" },
  { name: "酸棗仁湯", ingredients: "酸棗仁、知母、川芎、茯苓、甘草" },
  { name: "清淋湯", ingredients: "山藥、芡實、龍骨、牡蠣、生地黃、黨參、白芍" },
  { name: "膈下逐瘀湯", ingredients: "五靈脂、當歸、川芎、桃仁、丹皮、赤芍藥、烏藥、延胡索、甘草、香附、紅花、枳殼" },
  { name: "增液湯", ingredients: "玄參、麥冬、生地" },
  { name: "增液承氣湯", ingredients: "大黃、芒硝、玄參、麥冬、生地黃" },
  { name: "薏苡仁湯", ingredients: "薏苡仁、川芎、當歸、麻黃、桂枝、羌活、獨活、防風、川烏、蒼術、甘草、生薑" },
  { name: "橘皮竹茹湯", ingredients: "人參、橘皮、竹茹、甘草、生薑、大棗" },
  { name: "燃照湯", ingredients: "滑石、豆豉、焦山梔、酒黃芩、省頭草、制厚朴、制半夏、白蔻仁" },
  { name: "贊育丹", ingredients: "熟地黃、當歸、杜仲、巴戟肉、肉苁蓉、淫羊藿、蛇床子、肉桂、白術、枸杞子、仙茅、山茱萸、韭子、附子、或加人參、鹿茸" },
  { name: "黛蛤散", ingredients: "青黛、海蛤殼" },
  { name: "藿香正氣散", ingredients: "藿香、紫蘇、白芷、桔梗、白術、厚朴、半夏曲、大腹皮、茯苓、橘皮、甘草、大棗" },
  { name: "磁石滾痰丸", ingredients: "青礞石、沉香、大黃、黃芩、磁石" },
  { name: "癭藥散", ingredients: "海藻、黃藥子" },
  { name: "鼈甲煎丸", ingredients: "鼈甲、烏扇、黃芩、柴胡、鼠婦、干薑、大黃、芍藥、桂枝、葶藶子、石葦、厚朴、丹皮、瞿麥、紫葳、半夏、人參、地鱉蟲、阿膠、蜂房、赤硝、蜣螂、桃仁" },
  { name: "癲狂夢醒湯", ingredients: "桃仁、柴胡、香附、木通、赤芍藥、半夏、大腹皮、青皮、陳皮、桑白皮、蘇子、甘草" },
  { name: "薯藇丸", ingredients: "薯藇、人參、白術、茯苓、甘草、當歸、芍藥、川芎、干地黃、阿膠、麥冬、杏仁、桔梗、豆黃卷、防風、柴胡、桂枝、神曲、干薑、白蘞、大棗" },
  { name: "鎮肝熄風湯", ingredients: "懷牛膝、龍骨、生白芍、天冬、麥芽、代赭石、牡蠣、玄參、川楝子、茵陳蒿、甘草、龜版" },
  { name: "蠲痺湯", ingredients: "羌活、獨活、桂心、秦艽、當歸、川芎、炙甘草、海風藤、桑枝、乳香、木香" }
];
